[
{"title": "The Long Shadow of Small Ghosts: Murder and Memory in an American City", "price": "10.97", "rating": "One", "description": "In Cold Blood meets Adrian Nicole LeBlanc’s Random Family: A harrowing, profoundly personal investigation of the causes, effects, and communal toll of a deeply troubling crime—the brutal murder of three young children by their parents in the border city of Brownsville, Texas.On March 11, 2003, in Brownsville, Texas—one of America’s poorest cities—John Allen Rubio and Angel In Cold Blood meets Adrian Nicole LeBlanc’s Random Family: A harrowing, profoundly personal investigation of the causes, effects, and communal toll of a deeply troubling crime—the brutal murder of three young children by their parents in the border city of Brownsville, Texas.On March 11, 2003, in Brownsville, Texas—one of America’s poorest cities—John Allen Rubio and Angela Camacho murdered their three young children. The apartment building in which the brutal crimes took place was already rundown, and in their aftermath a consensus developed in the community that it should be destroyed. It was a place, neighbors felt, that was plagued by spiritual cancer. In 2008, journalist Laura Tillman covered the story for The Brownsville Herald. The questions it raised haunted her, particularly one asked by the sole member of the city’s Heritage Council to oppose demolition: is there any such thing as an evil building? Her investigation took her far beyond that question, revealing the nature of the toll that the crime exacted on a city already wracked with poverty. It sprawled into a six-year inquiry into the larger significance of such acts, ones so difficult to imagine or explain that their perpetrators are often dismissed as monsters alien to humanity. With meticulous attention and stunning compassion, Tillman surveyed those surrounding the crimes, speaking with the lawyers who tried the case, the family’s neighbors and relatives and teachers, even one of the murderers: John Allen Rubio himself, whom she corresponded with for years and ultimately met in person. The result is a brilliant exploration of some of our age’s most important social issues, from poverty to mental illness to the death penalty, and a beautiful, profound meditation on the truly human forces that drive them. It is disturbing, insightful, and mesmerizing in equal measure. ...more", "number_review": "15", "category": "Crime"},
{"title": "Dark Notes", "price": "19.19", "rating": "Five", "description": "They call me a slut. Maybe I am.Sometimes I do things I despise.Sometimes men take without asking.But I have a musical gift, only a year left of high school, and a plan.With one obstacle.Emeric Marceaux doesn’t just take.He seizes my will power and bangs it like a dark note.When he commands me to play, I want to give him everything.I kneel for his punishments, tremble for They call me a slut. Maybe I am.Sometimes I do things I despise.Sometimes men take without asking.But I have a musical gift, only a year left of high school, and a plan.With one obstacle.Emeric Marceaux doesn’t just take.He seizes my will power and bangs it like a dark note.When he commands me to play, I want to give him everything.I kneel for his punishments, tremble for his touch, and risk it all for our stolen moments.He’s my obsession, my master, my music.And my teacher. ...more", "number_review": "15", "category": "Erotica"},
{"title": "Amid the Chaos", "price": "36.58", "rating": "One", "description": "Some people call Eritrea the “North Korea of Africa.” But to two friends Chenkelo and Misghe, it is home. In the picturesque capital of Asmara, these two educated young men are forced to choose between poverty and hustle as they hide from a national service conscription that would send them to the front lines. Charismatic Misghe is a charmer, a philosopher, and a loving so Some people call Eritrea the “North Korea of Africa.” But to two friends Chenkelo and Misghe, it is home. In the picturesque capital of Asmara, these two educated young men are forced to choose between poverty and hustle as they hide from a national service conscription that would send them to the front lines. Charismatic Misghe is a charmer, a philosopher, and a loving son who is capable of having any woman in the city. But he’s about to flee his oppressive homeland—putting his longtime friendship with Chenkelo at stake. Chenkelo is a consummate hustler, resentful of his lot but in love with his city and his country. He has a poet’s heart whose passion will soon fuel activism and a belief that Eritrea’s beloved national project can yet be saved. Caught between the temptation of the Western dream and duty to their stagnated nation, Misghe and Chenkelo epitomize and transcend the trials and tribulations of an entire African generation. Amid the Chaos depicts the unflinching reality of a restless Eritrea in search of a meaning. ...more", "number_review": "15", "category": "Cultural"},
{"title": "Equal Is Unfair: America's Misguided Fight Against Income Inequality", "price": "56.86", "rating": "One", "description": "We’ve all heard that the American Dream is vanishing, and that the cause is rising income inequality. The rich are getting richer by rigging the system in their favor, leaving the rest of us to struggle just to keep our heads above water. To save the American Dream, we’re told that we need to fight inequality through tax hikes, wealth redistribution schemes, and a far high We’ve all heard that the American Dream is vanishing, and that the cause is rising income inequality. The rich are getting richer by rigging the system in their favor, leaving the rest of us to struggle just to keep our heads above water. To save the American Dream, we’re told that we need to fight inequality through tax hikes, wealth redistribution schemes, and a far higher minimum wage.But what if that narrative is wrong? What if the real threat to the American Dream isn’t rising income inequality—but an all-out war on success?In Equal is Unfair, a timely and thought-provoking work, Don Watkins and Yaron Brook reveal that almost everything we’ve been taught about inequality is wrong. You’ll discover:• why successful CEOs make so much money—and deserve to• how the minimum wage hurts the very people it claims to help• why middle-class stagnation is a myth• how the little-known history of Sweden reveals the dangers of forced equality• the disturbing philosophy behind Obama’s economic agenda.The critics of inequality are right about one thing: the American Dream is under attack. But instead of fighting to make America a place where anyone can achieve success, they are fighting to tear down those who already have. The real key to making America a freer, fairer, more prosperous nation is to protect and celebrate the pursuit of success—not pull down the high fliers in the name of equality. ...more", "number_review": "12", "category": "Politics"},
{"title": "The Art and Science of Low Carbohydrate Living", "price": "52.98", "rating": "Five", "description": "The Art And Science Of Low Carbohydrate Living: An Expert Guide To Making The Life-Saving Benefits Of Carbohydrate Restriction Sustainable And EnjoyableCarbohydrate restricted diets are commonly practiced but seldom taught. As a result, doctors, dietitians, nutritionists, and nurses may have strong opinions about low carbohydrate dieting, but in many if not most cases, the The Art And Science Of Low Carbohydrate Living: An Expert Guide To Making The Life-Saving Benefits Of Carbohydrate Restriction Sustainable And EnjoyableCarbohydrate restricted diets are commonly practiced but seldom taught. As a result, doctors, dietitians, nutritionists, and nurses may have strong opinions about low carbohydrate dieting, but in many if not most cases, these views are not grounded in science.Now, whether you are a curious healthcare professional or just a connoisseur of diet information, two New York Times best-selling authors provide you with the definitive resource for low carbohydrate living. Doctors Volek and Phinney share over 50 years of clinical experience using low carbohydrate diets, and together they have published more than 200 research papers and chapters on the topic. Particularly in the last decade, much has been learned about the risks associated with insulin resistance (including but not limited to metabolic synd ...more", "number_review": "9", "category": "Health"},
{"title": "Suzie Snowflake: One beautiful flake (a self-esteem story)", "price": "54.81", "rating": "Five", "description": "Follow Suzie on a magical journey of discovering her true self worth within.A beautifully illustrated self-esteem story for all ages!Suzie Snowflake struggles with what she sees as \"flaws\" and \"imperfections\" in her beautiful design. \"How can I notice my outer is bright, when there are parts of myself I don't really like?\"Through the love and wisdom of her parents, Suzie d Follow Suzie on a magical journey of discovering her true self worth within.﻿A beautifully illustrated self-esteem story for all ages!﻿﻿﻿Suzie Snowflake struggles with what she sees as \"flaws\" and \"imperfections\" in her beautiful design. \"How can I notice my outer is bright, when there are parts of myself I don't really like?\"Through the love and wisdom of her parents, Suzie discovers her true inner beauty and light. \"It's who you are inside that counts, your inner light that shines through, and who you are outside is wondrous too.\"\"Look at your art, look at your design, six magical sides, created one of a kind!\"\"Suzie dear, we love you for you. Each and every single part of you too!\"A wonderful affirmation of the importance of self-love and uniqueness; nurturing to every child. Coupled with 36 uplifting, awe-inspiring illustrations!Crystaline Rose is a teacher and children’s book author. She has read her books to thousands of children in classrooms and book readings. They are met with ‘Aha’ moments, appreciation and excitement. “The illustrations are magical and the story has meaning!” \"It's my favorite book ever!\" Parents share that their children are asking for “the rainbow book!” and look forward to reading it again and again.\" \"This is more than a children's book\" \"There is inspiration and hope to be found at any age.\" ...more", "number_review": "9", "category": "Novels"},
{"title": "The Grownup", "price": "35.88", "rating": "One", "description": "A canny young woman is struggling to survive by perpetrating various levels of mostly harmless fraud. On a rainy April morning, she is reading auras at Spiritual Palms when Susan Burke walks in. A keen observer of human behavior, our unnamed narrator immediately diagnoses beautiful, rich Susan as an unhappy woman eager to give her lovely life a drama injection. However, wh A canny young woman is struggling to survive by perpetrating various levels of mostly harmless fraud. On a rainy April morning, she is reading auras at Spiritual Palms when Susan Burke walks in. A keen observer of human behavior, our unnamed narrator immediately diagnoses beautiful, rich Susan as an unhappy woman eager to give her lovely life a drama injection. However, when the \"psychic\" visits the eerie Victorian home that has been the source of Susan's terror and grief, she realizes she may not have to pretend to believe in ghosts anymore. Miles, Susan's teenage stepson, doesn't help matters with his disturbing manner and grisly imagination. The three are soon locked in a chilling battle to discover where the evil truly lurks and what, if anything, can be done to escape it. ...more", "number_review": "8", "category": "Short Stories"},
{"title": "Silence in the Dark (Logan Point #4)", "price": "58.33", "rating": "Three", "description": "Two years ago, Bailey Adams broke off her engagement to Danny Maxwell and fled Logan Point for the mission field in Chihuahua, Mexico. Now she's about to return home to the States, but there's just one problem. After Bailey meets with the uncle of one of the mission children in the city, she barely escapes a sudden danger. Now she's on the run--she just doesn't know from w Two years ago, Bailey Adams broke off her engagement to Danny Maxwell and fled Logan Point for the mission field in Chihuahua, Mexico. Now she's about to return home to the States, but there's just one problem. After Bailey meets with the uncle of one of the mission children in the city, she barely escapes a sudden danger. Now she's on the run--she just doesn't know from whom. To make matters worse, people who help her along the way find themselves in danger too--including Danny. Who is after her? Will they ever let up? And in the midst of the chaos, can Bailey keep herself from falling in love with her rescuer all over again?With lean, fast-paced prose that keeps readers turning the pages, Patricia Bradley pens a superb story of suspense and second chances. ...more", "number_review": "8", "category": "Suspense"},
{"title": "Blue Like Jazz: Nonreligious Thoughts on Christian Spirituality", "price": "25.77", "rating": "One", "description": "\"I never liked jazz music because jazz music doesn't resolve. I used to not like God because God didn't resolve. But that was before any of this happened.\" ―Donald MillerIn Donald Miller's early years, he was vaguely familiar with a distant God. But when he came to know Jesus Christ, he pursued the Christian life with great zeal. Within a few years he had a successful mini \"I never liked jazz music because jazz music doesn't resolve. I used to not like God because God didn't resolve. But that was before any of this happened.\" ―Donald MillerIn Donald Miller's early years, he was vaguely familiar with a distant God. But when he came to know Jesus Christ, he pursued the Christian life with great zeal. Within a few years he had a successful ministry that ultimately left him feeling empty, burned out, and, once again, far away from God. In this intimate, soul-searching account, Miller describes his remarkable journey back to a culturally relevant, infinitely loving God.For anyone wondering if the Christian faith is still relevant in a postmodern culture.For anyone thirsting for a genuine encounter with a God who is real.For anyone yearning for a renewed sense of passion in  life.Blue Like Jazz is a fresh and original perspective on life, love, and redemption. ...more", "number_review": "7", "category": "Christian"},
{"title": "The Girl You Left Behind (The Girl You Left Behind #1)", "price": "15.79", "rating": "One", "description": "What happened to the girl you left behind?In 1916, French artist Edouard Lefevre leaves his wife Sophie to fight at the Front. When her town falls into German hands, his portrait of Sophie stirs the heart of the local Kommandant and causes her to risk everything - her family, reputation and life—in the hope of seeing her true love one last time.Nearly a century later and S What happened to the girl you left behind?In 1916, French artist Edouard Lefevre leaves his wife Sophie to fight at the Front. When her town falls into German hands, his portrait of Sophie stirs the heart of the local Kommandant and causes her to risk everything - her family, reputation and life—in the hope of seeing her true love one last time.Nearly a century later and Sophie's portrait is given to Liv by her young husband shortly before his sudden death. Its beauty speaks of their short life together, but when the painting's dark and passion-torn history is revealed, Liv discovers that the first spark of love she has felt since she lost him is threatened...In The Girl You Left Behind two young women, separated by a century, are united in their determination to fight for the thing they love most—whatever the cost. ...more", "number_review": "6", "category": "Historical"},
{"title": "How to Stop Worrying and Start Living", "price": "46.49", "rating": "Five", "description": "Learn how to break the worry habit -- Now and forever! With Dale Carnegie's timeless advice in hand, more than six million people have learned how to eliminate debilitating fear and worry from their lives and to embrace a worry-free future. In this classic work, How to Stop Worrying and Start Living, Carnegie offers a set of practical formulas that you can put to work tod Learn how to break the worry habit -- Now and forever! With Dale Carnegie's timeless advice in hand, more than six million people have learned how to eliminate debilitating fear and worry from their lives and to embrace a worry-free future. In this classic work, How to Stop Worrying and Start Living, Carnegie offers a set of practical formulas that you can put to work today. It is a book packed with lessons that will last a lifetime and make that lifetime happier! DISCOVER HOW TO: Eliminate fifty percent of business worries immediatelyReduce financial worriesAvoid fatigue -- and keep looking youngAdd one hour a day to your waking lifeFind yourself and be yourself -- remember there is no one else on earth like you! Fascinating to read and easy to apply, How to Stop Worrying and Start Living deals with fundamental emotions and life-changing ideas. There's no need to live with worry and anxiety that keep you from enjoying a full, active life! ...more", "number_review": "6", "category": "Self Help"},
{"title": "Logan Kade (Fallen Crest High #5.5)", "price": "13.12", "rating": "Two", "description": "People think that just because they know my name, my reputation, and my family that they know me. They don't.They say I’m a manwhore, but who wouldn’t be with my face and body? They say I’m a partier, and that's not going to change. They say I'm a fighter, and hell yes I am. F*ck with mine, and I’ll f*ck you back ten times worse.So, yes. Maybe what they say is true, but th People think that just because they know my name, my reputation, and my family that they know me. They don't.They say I’m a manwhore, but who wouldn’t be with my face and body? They say I’m a partier, and that's not going to change. They say I'm a fighter, and hell yes I am. F*ck with mine, and I’ll f*ck you back ten times worse.So, yes. Maybe what they say is true, but that’s not all of me.I'm loyal to a damned fault. If you earn it, I'll never leave your side. And when I love, I love hard, but there's another side to me where it's dark and painful. That side's been kept hidden, until her. Taylor saw inside of me, and the second she was there, she owned me.People think they know me……but only she can see me. ...more", "number_review": "5", "category": "Academic"},
{"title": "A New Earth: Awakening to Your Life's Purpose", "price": "55.65", "rating": "Five", "description": "The highly anticipated follow-up to the 2,000,000 copy bestselling inspirational book, \"The Power of Now\" With his bestselling spiritual guide \"The Power of Now,\" Eckhart Tolle inspired millions of readers to discover the freedom and joy of a life lived ?in the now.? In \"A New Earth,\" Tolle expands on these powerful ideas to show how transcending our ego-based state of co The highly anticipated follow-up to the 2,000,000 copy bestselling inspirational book, \"The Power of Now\" With his bestselling spiritual guide \"The Power of Now,\" Eckhart Tolle inspired millions of readers to discover the freedom and joy of a life lived ?in the now.? In \"A New Earth,\" Tolle expands on these powerful ideas to show how transcending our ego-based state of consciousness is not only essential to personal happiness, but also the key to ending conflict and suffering throughout the world. Tolle describes how our attachment to the ego creates the dysfunction that leads to anger, jealousy, and unhappiness, and shows readers how to awaken to a new state of consciousness and follow the path to a truly fulfilling existence. \"The Power of Now\" was a question-and-answer handbook. \"A New Earth\" has been written as a traditional narrative, offering anecdotes and philosophies in a way that is accessible to all. Illuminating, enlightening, and uplifting, \"A New Earth\" is a profoundly spiritual manifesto for a better way of life?and for building a better world. ...more", "number_review": "4", "category": "Spirituality"},
{"title": "We Are All Completely Beside Ourselves", "price": "24.04", "rating": "One", "description": "Meet the Cooke family. Our narrator is Rosemary Cooke. As a child, she never stopped talking; as a young woman, she has wrapped herself in silence: the silence of intentional forgetting, of protective cover. Something happened, something so awful she has buried it in the recesses of her mind.Now her adored older brother is a fugitive, wanted by the FBI for domestic terrori Meet the Cooke family. Our narrator is Rosemary Cooke. As a child, she never stopped talking; as a young woman, she has wrapped herself in silence: the silence of intentional forgetting, of protective cover. Something happened, something so awful she has buried it in the recesses of her mind.Now her adored older brother is a fugitive, wanted by the FBI for domestic terrorism. And her once lively mother is a shell of her former self, her clever and imperious father now a distant, brooding man.And Fern, Rosemary’s beloved sister, her accomplice in all their childhood mischief? Fern’s is a fate the family, in all their innocence, could never have imagined. ...more", "number_review": "3", "category": "Contemporary"},
{"title": "The Travelers", "price": "15.77", "rating": "One", "description": "A pulse-racing international thriller from the New York Times bestselling author of The Expats and The AccidentIt’s 3:00am. Do you know where your husband is?Meet Will Rhodes: travel writer, recently married, barely solvent, his idealism rapidly giving way to disillusionment and the worry that he’s living the wrong life. Then one night, on assignment for the award-winning A pulse-racing international thriller from the New York Times bestselling author of The Expats and The AccidentIt’s 3:00am. Do you know where your husband is?Meet Will Rhodes: travel writer, recently married, barely solvent, his idealism rapidly giving way to disillusionment and the worry that he’s living the wrong life. Then one night, on assignment for the award-winning Travelers magazine in the wine region of Argentina, a beautiful woman makes him an offer he can’t refuse. Soon Will’s bad choices—and dark secrets—take him across Europe, from a chateau in Bordeaux to a midnight raid on a Paris mansion, from a dive bar in Dublin to a mega-yacht in the Mediterranean and an isolated cabin perched on the rugged cliffs of Iceland. As he’s drawn further into a tangled web of international intrigue, it becomes clear that nothing about Will Rhodes was ever ordinary, that the network of deception ensnaring him is part of an immense and deadly conspiracy with terrifying global implications—and that the people closest to him may pose the greatest threat of all.It’s 3:00am. Your husband has just become a spy. ...more", "number_review": "3", "category": "Thriller"},
{"title": "The Rise of Theodore Roosevelt (Theodore Roosevelt #1)", "price": "42.57", "rating": "Three", "description": "Selected by the Modern Library as one of the 100 best nonfiction books of all timeDescribed by the Chicago Tribune as \"a classic,\" The Rise of Theodore Roosevelt stands as one of the greatest biographies of our time. The publication of The Rise of Theodore Roosevelt on September 14th, 2001 marks the 100th anniversary of Theodore Roosevelt becoming president.", "number_review": "3", "category": "Biography"},
{"title": "Rework", "price": "44.88", "rating": "Two", "description": "Most business books give you the same old advice: Write a business plan, study the competition, seek investors, yadda yadda. If you're looking for a book like that, put this one back on the shelf.Rework shows you a better, faster, easier way to succeed in business. Read it and you'll know why plans are actually harmful, why you don't need outside investors, and why you're Most business books give you the same old advice: Write a business plan, study the competition, seek investors, yadda yadda. If you're looking for a book like that, put this one back on the shelf.Rework shows you a better, faster, easier way to succeed in business. Read it and you'll know why plans are actually harmful, why you don't need outside investors, and why you're better off ignoring the competition. The truth is, you need less than you think. You don't need to be a workaholic. You don't need to staff up. You don't need to waste time on paperwork or meetings. You don't even need an office. Those are all just excuses.  What you really need to do is stop talking and start working. This book shows you the way. You'll learn how to be more productive, how to get exposure without breaking the bank, and tons more counterintuitive ideas that will inspire and provoke you.With its straightforward language and easy-is-better approach, Rework is the perfect playbook for anyone who’s ever dreamed of doing it on their own. Hardcore entrepreneurs, small-business owners, people stuck in day jobs they hate, victims of \"downsizing,\" and artists who don’t want to starve anymore will all find valuable guidance in these pages. ...more", "number_review": "3", "category": "Business"},
{"title": "The Lean Startup: How Today's Entrepreneurs Use Continuous Innovation to Create Radically Successful Businesses", "price": "33.92", "rating": "Three", "description": "Most startups fail. But many of those failures are preventable. The Lean Startup is a new approach being adopted across the globe, changing the way companies are built and new products are launched. Eric Ries defines a startup asan organization dedicated to creating something new under conditions of extreme uncertainty. This is just as true for one person in a garage or a Most startups fail. But many of those failures are preventable.  The Lean Startup is a new approach being adopted across the globe, changing the way companies are built and new products are launched. Eric Ries defines a startup as an organization dedicated to creating something new under conditions of extreme uncertainty. This is just as true for one person in a garage or a group of seasoned professionals in a Fortune 500 boardroom. What they have in common is a mission to penetrate that fog of uncertainty to discover a successful path to a sustainable business. The Lean Startup approach fosters companies that are both more capital efficient and that leverage human creativity more effectively.  Inspired by lessons from lean manufacturing, it relies on “validated learning,” rapid scientific experimentation, as well as a number of counter-intuitive practices that shorten product development cycles, measure actual progress without resorting to vanity metrics, and learn what customers really want. It enables a company to shift directions with agility, altering plans inch by inch, minute by minute. Rather than wasting time creating elaborate business plans, The Lean Startup offers entrepreneurs - in companies of all sizes - a way to test their vision continuously, to adapt and adjust before it’s too late. Ries provides a scientific approach to creating and managing successful startups in a age when companies need to innovate more than ever. ...more", "number_review": "3", "category": "Business"},
{"title": "Rich Dad, Poor Dad", "price": "51.74", "rating": "One", "description": "Personal finance author and lecturer Robert T. Kiyosaki developed his unique economic perspective from two very different influences - his two fathers. One father (Robert's real father) was a highly educated man but fiscally poor. The other father was the father of Robert's best friend - that Dad was an eighth-grade drop-out who became a self-made multi-millionaire. The li Personal finance author and lecturer Robert T. Kiyosaki developed his unique economic perspective from two very different influences - his two fathers. One father (Robert's real father) was a highly educated man but fiscally poor. The other father was the father of Robert's best friend - that Dad was an eighth-grade drop-out who became a self-made multi-millionaire. The lifelong monetary problems experienced by his poor dad pounded home the counterpoint communicated by his rich dad. Taking that message to heart, Kiyosaki was able to retire at 47. ...more", "number_review": "7", "category": "Business"},
{"title": "The E-Myth Revisited: Why Most Small Businesses Don't Work and What to Do About It", "price": "36.91", "rating": "One", "description": "E-Myth  'e-,'mith n 1: the entrepreneurial myth: the myth that most people who start small businesses are entrepreneurs 2: the fatal assumption that an individual who understands the technical work of a business can successfully run a business that does that technical workVoted #1 business book by Inc. 500 CEOs.An instant classic, this revised and updated edition of the E-Myth  'e-,'mith n 1: the entrepreneurial myth: the myth that most people who start small businesses are entrepreneurs 2: the fatal assumption that an individual who understands the technical work of a business can successfully run a business that does that technical workVoted #1 business book by Inc. 500 CEOs.An instant classic, this revised and updated edition of the phenomenal bestseller dispels the myths about starting your own business. Small business consultant and author Michael E. Gerber, with sharp insight gained from years of experience, points out how common assumptions, expectations, and even technical expertise can get in the way of running a successful business.Gerber walks you through the steps in the life of a business—from entrepreneurial infancy through adolescent growing pains to the mature entrepreneurial perspective: the guiding light of all businesses that succeed—and shows how to apply the lessons of franchising to any business, whether or not it is a franchise. Most importantly, Gerber draws the vital, often overlooked distinction between working on your business and working in your business.The E-Myth Revisited will help you grow your business in a productive, assured way. ...more", "number_review": "8", "category": "Business"},
{"title": "Born for This: How to Find the Work You Were Meant to Do", "price": "21.59", "rating": "Five", "description": "To the outside observer, it seems like they’ve won the career lottery—that by some stroke of luck or circumstance, they’ve found the one thing they love so much that it doesn’t even feel like work, and they’re getting paid well to do it. In reality, their good fortune has nothing to do with chance. There’s a method for finding your perfect job, and Chris Guillebeau, the be To the outside observer, it seems like they’ve won the career lottery—that by some stroke of luck or circumstance, they’ve found the one thing they love so much that it doesn’t even feel like work, and they’re getting paid well to do it. In reality, their good fortune has nothing to do with chance. There’s a method for finding your perfect job, and Chris Guillebeau, the bestselling author of The $100 Startup, has created a practical guide for how to do it—whethe rwithin a traditional company or business, or by striking out on your own. Finding the work you were “born to do” isn’t just about discovering your passion. Doing what brings you joy is great, but if you aren’t earning a living, it’s a hobby, not a career. And those who jump out of bed excited to go to work every morning don’t just have jobs that turn their passions into paychecks. They have jobs where they also can lose themselves for hours in the flow of meaningful work. This intersection of joy, money, and flow is what Guillebeau will help you find in this book. Through inspiring stories of those who have successfully landed their dream career, as well as actionable tools, exercises, and thought experiments, he’ll guide you through today’s vast menu of career options to discover the work perfectly suited to your unique interests, skills, and experiences.You’ll learn how to:• Hack the job of your dreams within a traditional organization by making it work for you• Find not only your ideal work but also your ideal working conditions• Create plans that will allow you to take smarter career risks and “beat the house” every time• Start a profitable “side hustle” and earn extra cash on top of your primary stream of income• Escape the prison of working for someone else and build a mini-empire as an entrepreneur• Become a rock star at any creative endeavor by creating a loyal base of fans and followersWhichever path you choose, this book will show you how to find that one job or career that feels so right, it’s like you were born to do it. ...more", "number_review": "11", "category": "Business"},
{"title": "The Art of Startup Fundraising", "price": "21.00", "rating": "Three", "description": "The Art of Startup Fundraising takes a fresh look at raising money for startups, with a focus on the changing face of startup finance. New regulations are making the old go-to advice less relevant, as startup money is increasingly moving online. These new waters are all but uncharted—and founders need an accessible guide. This book helps you navigate the online world of st The Art of Startup Fundraising takes a fresh look at raising money for startups, with a focus on the changing face of startup finance. New regulations are making the old go-to advice less relevant, as startup money is increasingly moving online. These new waters are all but uncharted—and founders need an accessible guide. This book helps you navigate the online world of startup fundraising with easy-to-follow explanations and expert perspective on the new digital world of finance. You'll find tips and tricks on raising money and investing in startups from early stage to growth stage, and develop a clear strategy based on the new realities surrounding today's startup landscape.The finance world is in a massive state of flux. Changes are occurring at an increasing pace in all sectors, but few more intensely than the startup sphere. When the paradigm changes, your processes must change with it. This book shows you how startup funding works, with expert coaching toward the new rules on the field.-Learn how the JOBS Act impacts the fundraising model-Gain insight on startups from early stage to growth stage-Find the money you need to get your venture going-Craft your pitch and optimize the strategy-Build momentum-Identify the right investors-Avoid the common mistakesDon't rely on the \"how we did it\" tales from superstar startups, as these stories are unique and applied to exceptional scenarios. The game has changed, and playing by the old rules only gets you left behind. Whether you're founding a startup or looking to invest, The Art of Startup Fundraising provides the up-to-the-minute guidance you need.PRAISE FOR THE ART OF STARTUP FUNDRAISING:“The Art of Startup Fundraising is a must read for anyone who even considers starting a business. Fundraising is hard. This book gives you the roadmap to get where you are going. Alejandro Cremades speaks with wisdom and from experience.“ - Tim Draper , Founder of Draper Associates, DFJ, and Draper University.\"The Art of Startup Fundraising should be a mandatory reading for entrepreneurs that are looking to raise capital. This book will enable Alejandro to help many more early stage companies answer the tough questions when fundraising.\" - Marco Landi, Former Chief Operating Officer at Apple and Chairman at Atlantis Ventures\"Raising capital is often the most daunting and least understood aspects of starting a new business and there are few people more experienced than Alejandro Cremades to act as a guide. The Art of Startup Fundraising unlocks key secrets of fundraising for newly minted entrepreneurs.\" - Jeff Stibel, Chairman of BrainGate, Inc. and Vice Chairman of Dun & Bradstreet, Inc.; New York Times bestselling author of Breakpoint and Wired for Thought.\"This book provides a clear, concise tour of the fundraising game. With his crowdfunding and entrepreneurial expertise in full display, Cremades does a terrific job making a complicated process simple and accessible.\" - Jeff Bussgang, General Partner at Flybridge Capital Partners and Senior Lecturer at Harvard Business School“Entrepreneurs need to be amazing at recruiting, selling and fundraising. The Art of Startup Fundraising provides the essential toolkit for mastering a core skill for any entrepreneur.” - Gil Penchina, serial entrepreneur and prolific angel investor“For many entrepreneurs finding the right investor for their venture can be a daunting task. Alejandro's experience with equity crowdfunding gives a unique perspective on the fundraising game. The Art of Startup Fundraising is very insightful for entrepreneurs looking to close a round of financing and changing the world.” - Anyndya Ghose, Professor at NYU Stern School of Business“There is no perfect approach to raising investment for a startup, but there is a certain tribal knowledge out there, that most of us had to learn through several failed attempts. The Art of Startup Fundraising captures every bit of advice (and then some!) that I would give to any entrepreneur looking for funding.” - Paul Murphy, Partner at Betaworks and CoFounder of Playdots“Alejandro's The Art of Startup Fundraising is a must read for any entrepreneur. Clear and concise, he outlines in today's startup community the steps to successfully fundraise. This is the golden era for entrepreneurs, any good idea with proof of concept can get access to money. Know your options!” - Angelo J. Robles, Founder and CEO of Family Office Association“It doesn't matter how great of a business you can build. If you can't raise money, you're toast. Master this book.” - Ilya Pozin, Forbes Contributor and CoFounder of Pluto TV and CoFounder of Coplex\"The Art of Startup Fundraising translates art into science. By sharing proven formulas, strategies, and case studies that work, Alejandro Cremades provides a needed service to future entrepreneurs.\" - Josh Cohen, Managing Partner at City Light Capital“This ought to be a reading requirement for all entrepreneurs when building a business and raising capital. This is a very well written and informative book, written by a man who is a testament to dedication and creativity when confronted with the challenges of being an entrepreneur and raising capital.” - Carter Caldwell, serial entrepreneur and Principal at Cross Atlantic Capital Partners“Alejandro is on the bleeding edge of equity crowdfunding today. When he talks about fundraising, startups listen.” - Andrew Ackerman, Managing Director at Dreamit Ventures“Raising capital can be tough. Alejandro provides a step-by-step guidebook to all entrepreneurs that rather spend their time thinking about changing the world instead of thinking of how to raise funds.” - Tobias P. Schirmer, Managing Partner of JOIN Capital \"A superb book on fundraising. Alejandro's guidance should arm entrepreneurs with the necessary tools to close with success a meaningful round of financing.\" - Ellen Weber, Executive Director at Robin Hood Ventures“The Art of Startup Fundraising is a practical and comprehensive resource for entrepreneurs to use again and again. It captures what startups need to do to be successful in the rapidly evolving financing world, while also providing tips on the fundamentals of building businesses that don’t change over time.” - Marianne Hudson, Executive Director at Angel Capital Association“Raising money is hard. But start-up founders all over the world can make it exponentially easier by educating themselves on the process of raising equity capital before they dive into it. The practical, hands-on advice from Alejandro Cremades in this book provides a solid foundation in that self-education process. Delivered in an approachable format with a key lesson to take-away every few pages, “The Art of Startup Fundraising” is essential reading for entrepreneurs everywhere.” - Allen Taylor, Managing Director at Endeavor ...more", "number_review": "11", "category": "Business"},
{"title": "Quench Your Own Thirst: Business Lessons Learned Over a Beer or Two", "price": "43.14", "rating": "One", "description": "Founder of The Boston Beer Company, brewer of Samuel Adams Boston Lager, and a key catalyst of the American craft beer revolution, Jim Koch offers his unique perspective when it comes to business, beer, and turning your passion into a successful company or career.In 1984, it looked like an unwinnable David and Goliath struggle: one guy against the mammoth American beer ind Founder of The Boston Beer Company, brewer of Samuel Adams Boston Lager, and a key catalyst of the American craft beer revolution, Jim Koch offers his unique perspective when it comes to business, beer, and turning your passion into a successful company or career.In 1984, it looked like an unwinnable David and Goliath struggle: one guy against the mammoth American beer industry. When others scoffed at Jim Koch’s plan to leave his consulting job and start a brewery that would challenge American palates, he chose a nineteenth-century family recipe and launched Samuel Adams. Now one of America’s leading craft breweries, Samuel Adams has redefined the way Americans think about beer and helped spur a craft beer revolution.In Quench Your Own Thirst, Koch offers unprecedented insights into the whirlwind ride from scrappy start-up to thriving public company. His innovative business model and refreshingly frank stories offer counterintuitive lessons that you can apply to business and to life.Koch covers everything from finding your own Yoda to his theory on how a piece of string can teach you the most important lesson you’ll ever learn about business. He also has surprising advice on sales, marketing, hiring, and company culture. Koch’s anecdotes, quirky musings, and bits of wisdom go far beyond brewing. A fun, engaging guide for building a career or launching a successful business based on your passions, Quench Your Own Thirst is the key to the ultimate dream: being successful while doing what you love. ...more", "number_review": "12", "category": "Business"},
{"title": "Made to Stick: Why Some Ideas Survive and Others Die", "price": "38.85", "rating": "Five", "description": "Mark Twain once observed, “A lie can get halfway around the world before the truth can even get its boots on.” His observation rings true: Urban legends, conspiracy theories, and bogus public-health scares circulate effortlessly. Meanwhile, people with important ideas–business people, teachers, politicians, journalists, and others–struggle to make their ideas “stick.” Why Mark Twain once observed, “A lie can get halfway around the world before the truth can even get its boots on.” His observation rings true: Urban legends, conspiracy theories, and bogus public-health scares circulate effortlessly. Meanwhile, people with important ideas–business people, teachers, politicians, journalists, and others–struggle to make their ideas “stick.” Why do some ideas thrive while others die? And how do we improve the chances of worthy ideas? In Made to Stick, accomplished educators and idea collectors Chip and Dan Heath tackle head-on these vexing questions. Inside, the brothers Heath reveal the anatomy of ideas that stick and explain ways to make ideas stickier, such as applying the “human scale principle,” using the “Velcro Theory of Memory,” and creating “curiosity gaps.”In this indispensable guide, we discover that sticky messages of all kinds–from the infamous “kidney theft ring” hoax to a coach’s lessons on sportsmanship to a vision for a new product at Sony–draw their power from the same six traits.Made to Stick is a book that will transform the way you communicate ideas. It’s a fast-paced tour of success stories (and failures)–the Nobel Prize-winning scientist who drank a glass of bacteria to prove a point about stomach ulcers; the charities who make use of “the Mother Teresa Effect”; the elementary-school teacher whose simulation actually prevented racial prejudice. Provocative, eye-opening, and often surprisingly funny, Made to Stick shows us the vital principles of winning ideas–and tells us how we can apply these rules to making our own messages stick. ...more", "number_review": "14", "category": "Business"},
{"title": "Shoe Dog: A Memoir by the Creator of NIKE", "price": "23.99", "rating": "Two", "description": "In this candid and riveting memoir, for the first time ever, Nike founder and CEO Phil Knight shares the inside story of the company’s early days as an intrepid start-up and its evolution into one of the world’s most iconic, game-changing, and profitable brands.In 1962, fresh out of business school, Phil Knight borrowed $50 from his father and created a company with a simp In this candid and riveting memoir, for the first time ever, Nike founder and CEO Phil Knight shares the inside story of the company’s early days as an intrepid start-up and its evolution into one of the world’s most iconic, game-changing, and profitable brands.In 1962, fresh out of business school, Phil Knight borrowed $50 from his father and created a company with a simple mission: import high-quality, low-cost athletic shoes from Japan. Selling the shoes from the trunk of his lime green Plymouth Valiant, Knight grossed $8,000 his first year. Today, Nike’s annual sales top $30 billion. In an age of startups, Nike is the ne plus ultra of all startups, and the swoosh has become a revolutionary, globe-spanning icon, one of the most ubiquitous and recognizable symbols in the world today.But Knight, the man behind the swoosh, has always remained a mystery. Now, for the first time, in a memoir that is candid, humble, gutsy, and wry, he tells his story, beginning with his crossroads moment. At 24, after backpacking around the world, he decided to take the unconventional path, to start his own business—a business that would be dynamic, different.Knight details the many risks and daunting setbacks that stood between him and his dream—along with his early triumphs. Above all, he recalls the formative relationships with his first partners and employees, a ragtag group of misfits and seekers who became a tight-knit band of brothers. Together, harnessing the transcendent power of a shared mission, and a deep belief in the spirit of sport, they built a brand that changed everything. ...more", "number_review": "15", "category": "Business"},
{"title": "The 10% Entrepreneur: Live Your Startup Dream Without Quitting Your Day Job", "price": "27.55", "rating": "Three", "description": "Choosing between the stability of a traditional career and the upside of entrepreneurship? Why not have both?Becoming a full-time entrepreneur can look glamorous from the outside. Who doesn’t want to chase their dreams, be their own boss, and do what they love? But the truth is that entrepreneurship is often a slog, with no regular hours, no job security, and very little p Choosing between the stability of a traditional career and the upside of entrepreneurship? Why not have both?Becoming a full-time entrepreneur can look glamorous from the outside. Who doesn’t want to chase their dreams, be their own boss, and do what they love? But the truth is that entrepreneurship is often a slog, with no regular hours, no job security, and very little pay.  What if there was a way to have the stability of a day job with the excitement of a startup? All of the benefits of entrepreneurship with none of the pitfalls? In The 10% Entrepreneur, Patrick McGinnis shows you how, by investing just 10% of your time and resources, you can become an entrepreneur without losing a steady paycheck.  McGinnis details a step-by-step plan that takes you from identifying your first entrepreneurial project to figuring out the smartest way to commit resources to it. He shows you how to select and engage in projects that will provide you with upside outside the office while making your better at your day job. He also profiles real-world 10% Entrepreneurs such as...•Luke Holden, a cash-strapped recent college graduate, who started his own lobster-roll empire and oversaw much of its first year of operations, all while working full time in corporate America•Dipali Patwa, a designer and mom whose side project designing and selling infant clothing is now a sensation.•A group of friends who met at a 6am Bible study class and went on to start a brewery that now generates millions in sales . A successful 10% Entrepreneur himself, McGinnis explains the multiple paths you can follow to invest your cash, time, and expertise in a start-up—including as a founder, angel, adviser, or aficionado. Most importantly, you don’t have to have millions in disposable income to become a 10% Entrepreneur. When you put McGinnis’s 10% principles into action, you’ll quickly start racking up small wins, then watch as they snowball into your new (and far more entrepreneurial) life. ...more", "number_review": "15", "category": "Business"},
{"title": "The Third Wave: An Entrepreneur’s Vision of the Future", "price": "12.61", "rating": "Five", "description": "NEW YORK TIMES BESTSELLERWALL STREET JOURNAL BESTSELLEROne of America’s most accomplished entrepreneurs—a pioneer who made the Internet part of everyday life and orchestrated the largest merger in the history of business—shares a roadmap for how anyone can succeed in a world of rapidly changing technology.Steve Case’s career began when he cofounded America Online (AOL) in NEW YORK TIMES BESTSELLERWALL STREET JOURNAL BESTSELLEROne of America’s most accomplished entrepreneurs—a pioneer who made the Internet part of everyday life and orchestrated the largest merger in the history of business—shares a roadmap for how anyone can succeed in a world of rapidly changing technology.Steve Case’s career began when he cofounded America Online (AOL) in 1985. At the time, only three percent of Americans were online. It took a decade for AOL to achieve mainstream success, and there were many near-death experiences and back-to-the-wall pivots. AOL became the top performing company of the 1990s, and at its peak more than half of all consumer Internet traffic in the United States ran through the service. After Case engineered AOL’s merger with Time Warner and he became Chairman of the combined business, Case oversaw the biggest media and communications empire in the world. In The Third Wave, which pays homage to the work of the futurist Alvin Toffler (from whom Case has borrowed the title, and whose work inspired him as a young man), Case takes us behind the scenes of some of the most consequential and riveting business decisions of our time while offering illuminating insights from decades of working as an entrepreneur, an investor, a philanthropist, and an advocate for sensible bipartisan policies. We are entering, as Case explains, a new paradigm called the “Third Wave” of the Internet. The first wave saw AOL and other companies lay the foundation for consumers to connect to the Internet. The second wave saw companies like Google and Facebook build on top of the Internet to create search and social networking capabilities, while apps like Snapchat and Instagram leverage the smartphone revolution. Now, Case argues, we’re entering the Third Wave: a period in which entrepreneurs will vastly transform major “real world” sectors like health, education, transportation, energy, and food—and in the process change the way we live our daily lives. But success in the Third Wave will require a different skill set, and Case outlines the path forward.The Third Wave is part memoir, part manifesto, and part playbook for the future. With passion and clarity, Case explains the ways in which newly emerging technology companies (a growing number of which, he argues, will not be based in Silicon Valley) will have to rethink their relationships with customers, with competitors, and with governments; and offers advice for how entrepreneurs can make winning business decisions and strategies—and how all of us can make sense of this changing digital age. ...more", "number_review": "15", "category": "Business"},
{"title": "The Dirty Little Secrets of Getting Your Dream Job", "price": "33.34", "rating": "Four", "description": "Drawing on his extensive experience evaluating applicants for his marketing agency, and featuring stories based on real-life situations, sample cover letters, resumes, and straightforward advice, Don Raskin’s The Dirty Little Secrets of Getting Your Dream Job offers all the necessary tools for navigating the tough job market and securing your dream job.Don Raskin owns and Drawing on his extensive experience evaluating applicants for his marketing agency, and featuring stories based on real-life situations, sample cover letters, resumes, and straightforward advice, Don Raskin’s The Dirty Little Secrets of Getting Your Dream Job offers all the necessary tools for navigating the tough job market and securing your dream job.Don Raskin owns and operates MME, an advertising and marketing agency in New York City. During his twenty-five years at the agency he has interviewed hundreds of new college graduates for positions within his agency and has placed a strong emphasis on entry-level recruitment for positions in creative, account management, traffic, and production. Raskin has also mentored countless students and their parents on best practices for the job search. Over the years, Raskin has kept exceptionally detailed notes on the interviews he has conducted, observing the good, the bad, the ridiculous, the irreverent. He also has a treasure trove of over-the-top cover letters, resumes, interviews, and post interview follow-ups he has conducted and received. Now, he wants to share all the wisdom and insider secrets he has gathered to help students and first-time job seekers find a job in this economy.Based on his remarkable expertise, Raskin's book provides exclusive insight into the job search process and lets readers in on all of the dirty little secrets to landing their first job—or a new one—and finding career success. ...more", "number_review": "19", "category": "Business"},
{"title": "Benjamin Franklin: An American Life", "price": "48.19", "rating": "Three", "description": "Benjamin Franklin is the Founding Father who winks at us. An ambitious urban entrepreneur who rose up the social ladder, from leather-aproned shopkeeper to dining with kings, he seems made of flesh rather than of marble. In bestselling author Walter Isaacson's vivid and witty full-scale biography, we discover why Franklin seems to turn to us from history's stage with eyes Benjamin Franklin is the Founding Father who winks at us. An ambitious urban entrepreneur who rose up the social ladder, from leather-aproned shopkeeper to dining with kings, he seems made of flesh rather than of marble. In bestselling author Walter Isaacson's vivid and witty full-scale biography, we discover why Franklin seems to turn to us from history's stage with eyes that twinkle from behind his new-fangled spectacles. By bringing Franklin to life, Isaacson shows how he helped to define both his own time and ours. He was, during his 84-year life, America's best scientist, inventor, diplomat, writer, and business strategist, and he was also one of its most practical -- though not most profound -- political thinkers. He proved by flying a kite that lightning was electricity, and he invented a rod to tame it. He sought practical ways to make stoves less smoky and commonwealths less corrupt. He organized neighborhood constabularies and international alliances, local lending libraries and national legislatures. He combined two types of lenses to create bifocals and two concepts of representation to foster the nation's federal compromise. He was the only man who shaped all the founding documents of America: the Albany Plan of Union, the Declaration of Independence, the treaty of alliance with France, the peace treaty with England, and the Constitution. And he helped invent America's unique style of homespun humor, democratic values, and philosophical pragmatism. But the most interesting thing that Franklin invented, and continually reinvented, was himself. America's first great publicist, he was, in his life and in his writings, consciously trying to create a new American archetype. In the process, he carefully crafted his own persona, portrayed it in public, and polished it for posterity. Through it all, he trusted the hearts and minds of his fellow \"leather-aprons\" more than he did those of any inbred elite. He saw middle-class values as a source of social strength, not as something to be derided. His guiding principle was a \"dislike of everything that tended to debase the spirit of the common people.\" Few of his fellow founders felt this comfort with democracy so fully, and none so intuitively. In this colorful and intimate narrative, Isaacson provides the full sweep of Franklin's amazing life, from his days as a runaway printer to his triumphs as a statesman, scientist, and Founding Father. He chronicles Franklin's tumultuous relationship with his illegitimate son and grandson, his practical marriage, and his flirtations with the ladies of Paris. He also shows how Franklin helped to create the American character and why he has a particular resonance in the twenty-first century. ...more", "number_review": "7", "category": "Biography"},
{"title": "The Faith of Christopher Hitchens: The Restless Soul of the World's Most Notorious Atheist", "price": "39.55", "rating": "One", "description": "“If everyone in the United States had the same qualities of loyalty and care and concern for others that Larry Taunton had, we'd be living in a much better society than we do.” ~ Christopher HitchensAt the time of his death, Christopher Hitchens was the most notorious atheist in the world. And yet, all was not as it seemed. “Nobody is not a divided self, of course,” heonce “If everyone in the United States had the same qualities of loyalty and care and concern for others that Larry Taunton had, we'd be living in a much better society than we do.” ~ Christopher HitchensAt the time of his death, Christopher Hitchens was the most notorious atheist in the world.  And yet, all was not as it seemed.  “Nobody is not a divided self, of course,” he once told an interviewer, “but I think it’s rather strong in my case.”   Hitchens was a man of many contradictions:   a Marxist in youth who longed for acceptance among the social elites; a peacenik who revered the military; a champion of the Left who was nonetheless pro-life, pro-war-on-terror, and after 9/11 something of a neocon; and while he railed against God on stage, he maintained meaningful—though largely hidden from public view—friendships with evangelical Christians like Francis Collins, Douglas Wilson, and the author Larry Alex Taunton.  In The Faith of Christopher Hitchens, Taunton offers a very personal perspective of one of our most interesting and most misunderstood public figures.  Writing with genuine compassion and without compromise, Taunton traces Hitchens’s spiritual and intellectual development from his decision as a teenager to reject belief in God to his rise to prominence as one of the so-called “Four Horsemen” of the New Atheism.  While Hitchens was, in the minds of many Christians, Public Enemy Number One, away from the lights and the cameras a warm friendship flourished between Hitchens and the author; a friendship that culminated in not one, but two lengthy road trips where, after Hitchens’s diagnosis of esophageal cancer, they studied the Bible together.  The Faith of Christopher Hitchens gives us a candid glimpse into the inner life of this intriguing, sometimes maddening, and unexpectedly vulnerable man.“This book should be read by every atheist and theist passionate about the truth.”--Michael Shermer, publisher, Skeptic magazine ...more", "number_review": "7", "category": "Biography"},
{"title": "Setting the World on Fire: The Brief, Astonishing Life of St. Catherine of Siena", "price": "21.15", "rating": "Two", "description": "One of only two patron saints of Italy, the other being St. Francis of Assisi, St. Catherine was ahead of her time. As a political powerhouse in late 14th century Europe, a time of war, social unrest and one of the worst natural disasters of all time--the plague, she worked for peace between Christians while campaigning for a holy crusade against Muslims. She was illiterat One of only two patron saints of Italy, the other being St. Francis of Assisi, St. Catherine was ahead of her time. As a political powerhouse in late 14th century Europe, a time of war, social unrest and one of the worst natural disasters of all time--the plague, she worked for peace between Christians while campaigning for a holy crusade against Muslims. She was illiterate but grew into a great writer by dictating to assistants. She was frail and punished herself mercilessly, often starving herself, while offering moral guidance and inspiration to kings, queens and popes.It's easy to see why feminists through the years have sought to claim the patronage of St. Catherine. From her refusal to marry to her assertion that her physical appearance was of no importance, the famous Saint is ripe for modern interpretation. She was a peacemaker during Siena's revolution of 1368, sometimes addressing thousands of people in squares and streets; she convinced Pope Gregory XI to return the papacy to Rome at a time when the Catholic Church was unraveling.How did this girl, the second-youngest of 25 children of a middle-class dyer, grow to become one of the most beloved spiritual figures of all time, a theological giant to rank alongside the likes of Thomas Aquinas? InSetting the World on Fire, Emling gives an intimate portrayal of this fascinating and revolutionary woman. ...more", "number_review": "11", "category": "Biography"},
{"title": "Louisa: The Extraordinary Life of Mrs. Adams", "price": "16.85", "rating": "Two", "description": "An intimate portrait of Louisa Catherine Adams, the wife of John Quincy Adams, who witnessed firsthand the greatest transformations of her time Born in London to an American father and a British mother on the eve of the Revolutionary War, Louisa Catherine Johnson was raised in circumstances very different from the New England upbringing of the future president John Quincy An intimate portrait of Louisa Catherine Adams, the wife of John Quincy Adams, who witnessed firsthand the greatest transformations of her time    Born in London to an American father and a British mother on the eve of the Revolutionary War, Louisa Catherine Johnson was raised in circumstances very different from the New England upbringing of the future president John Quincy Adams, whose life had been dedicated to public service from the earliest age. And yet John Quincy fell in love with her, almost despite himself. Their often tempestuous but deeply close marriage lasted half a century.  They lived in Prussia, Massachusetts, Washington, Russia, and England, at royal courts, on farms, in cities, and in the White House. Louisa saw more of Europe and America than nearly any other woman of her time. But wherever she lived, she was always pressing her nose against the glass, not quite sure whether she was looking in or out. The other members of the Adams family could take their identity for granted—they were Adamses; they were Americans—but she had to invent her own. The story of Louisa Catherine Adams is one of a woman who forged a sense of self. As the country her husband led found its place in the world, she found a voice. That voice resonates still.  In this deeply felt biography, the talented journalist and historian Louisa Thomas finally gives Louisa Catherine Adams's full extraordinary life its due. An intimate portrait of a remarkable woman, a complicated marriage, and a pivotal historical moment, Louisa Thomas's biography is a masterful work from an elegant storyteller. ...more", "number_review": "15", "category": "Biography"},
{"title": "Far From True (Promise Falls Trilogy #2)", "price": "34.93", "rating": "Two", "description": "New York Times and #1 international bestselling author Linwood Barclay delivers the second spine-chilling thriller set in the troubled town of Promise Falls, following the electrifying cliffhanger ending of Broken Promise... After the screen of a run-down drive-in movie theater collapses and kills fourpeople, the daughter of one of the victims asks private investigator Ca New York Times and #1 international bestselling author Linwood Barclay delivers the second spine-chilling thriller set in the troubled town of Promise Falls, following the electrifying cliffhanger ending of Broken Promise...   After the screen of a run-down drive-in movie theater collapses and kills four people, the daughter of one of the victims asks private investigator Cal Weaver to look into a recent break-in at her father’s house. Cal discovers a hidden basement room where it’s clear that salacious activities have taken place—as well as evidence of missing DVDs. But his investigation soon becomes more complicated when he realizes it may not be discs the thief was actually interested in....   Meanwhile, Detective Barry Duckworth is still trying to solve two murders—one of which is three years old—he believes are connected, since each featured a similar distinctive wound.   As the lies begin to unravel, Cal is headed straight into the heart of a dark secret as his search uncovers more startling truths about Promise Falls. And when yet another murder happens, Cal and Barry are both driven to pursue their investigations, no matter where they lead. Evil deeds long thought buried are about to haunt the residents of this town—as the sins of the past and present collide with terrifying results. ...more", "number_review": "4", "category": "Thriller"},
{"title": "The Bone Hunters (Lexy Vaughan & Steven Macaulay #2)", "price": "59.71", "rating": "Three", "description": "The award-winning author of Valhalla brings back archaeologist Lexy Vaughan and retired Air Force officer Steve Macaulay, as they race to save a priceless discovery from disappearing forever.… One of the greatest archaeological finds of all time, Peking Man, the 780,000-year-old remains of our earliest known human ancestor, disappeared during World War II from a cargo shi The award-winning author of Valhalla brings back archaeologist Lexy Vaughan and retired Air Force officer Steve Macaulay, as they race to save a priceless discovery from disappearing forever.…   One of the greatest archaeological finds of all time, Peking Man, the 780,000-year-old remains of our earliest known human ancestor, disappeared during World War II from a cargo ship bound for America.   Now the Chinese government is fighting to keep a new religion from taking hold—a faith based on the belief that Peking Man is God. And they dispatch ruthless operatives to find and destroy the world’s most priceless fossil.   But the U.S. government has its own team on the hunt. From the mountains of Bavaria to the jungles of Central America and across the vast Pacific, Professor Barnaby Finchem, his brilliant protégé, Lexy Vaughan, and pilot Steve Macaulay will brave the wrath of nature and of man to win a race against unbridled tyranny.… ...more", "number_review": "4", "category": "Thriller"},
{"title": "Killing Floor (Jack Reacher #1)", "price": "31.49", "rating": "Four", "description": "Ex-military policeman Jack Reacher is a drifter. He's just passing through Margrave, Georgia, and in less than an hour, he's arrested for murder. Not much of a welcome. All Jack knows is that he didn't kill anybody. At least not here. Not lately. But he doesn't stand a chance of convincing anyone. not in Margrave, Georgia. Not a chance in hell.", "number_review": "5", "category": "Thriller"},
{"title": "Give It Back", "price": "18.32", "rating": "Two", "description": "This novel follows three characters: Lorraine, Lexy, and Ella.Lorraine:Not long ago, Lorraine lost her husband to another woman. She thought that was the worst thing that could happen to her, but soon she realizes it’s just the beginning of an everlasting nightmare. Lexy:Lexy, an au pair from London, moves to Seattle to help Lorraine with her infant son. But she didn’t com This novel follows three characters: Lorraine, Lexy, and Ella.Lorraine:Not long ago, Lorraine lost her husband to another woman. She thought that was the worst thing that could happen to her, but soon she realizes it’s just the beginning of an everlasting nightmare. Lexy:Lexy, an au pair from London, moves to Seattle to help Lorraine with her infant son. But she didn’t come for the child…she came for something else. Ella:When Ella receives a call from her sister, Lorraine, who begs her to leave San Diego to spend time with her, she decides to take a few days off from work to visit her. Frightened to see how much Lorraine has weakened since her diagnosis eight months ago, she packs a bag and heads to Seattle with a foreboding feeling that this might be the last time she sees Lorraine. But on her way to the airport, she learns that something shocking has happened since she last spoke with Lorraine and now. To make matters worse, once Ella arrives in Seattle, Lorraine’s story keeps changing, making Ella question how reliable her sister really is. Soon Ella is entangled in a mysterious investigation, and more so, in the lives of everyone involved. She realizes not only that she won’t go home anytime soon but also that she’ll never look at others the same way she did before. ...more", "number_review": "6", "category": "Thriller"},
{"title": "The 14th Colony (Cotton Malone #11)", "price": "39.24", "rating": "One", "description": "Shot down over Siberia in what was to be a simple meet-and-greet-mission, ex-Justice Department agent Cotton Malone is forced into a fight for survival against Aleksandr Zorin, whose loyalty to the former Soviet Union has festered for decades into an intense hatred of the United States.Before escaping, Malone learns that Zorin and another ex-KGB officer, this one a sleeper Shot down over Siberia in what was to be a simple meet-and-greet-mission, ex-Justice Department agent Cotton Malone is forced into a fight for survival against Aleksandr Zorin, whose loyalty to the former Soviet Union has festered for decades into an intense hatred of the United States.Before escaping, Malone learns that Zorin and another ex-KGB officer, this one a sleeper still imbedded in the West, are headed overseas to Washington D.C. Inauguration Day-noon on January 20th-is only hours away. A flaw in the Constitution, and an even more flawed presidential succession act, have opened the door to political chaos and Zorin intends to exploit both weaknesses to their fullest.Armed with a weapon leftover from the Cold War, one long thought to be just a myth, Zorin plans to attack. He's aided by a shocking secret hidden in the archives of America's oldest fraternal organization-the Society of Cincinnati-a group that once lent out its military savvy to presidents, including helping to formulate three covert invasion plans of Canada.In a race against the clock that starts in the frozen extremes of Russia and ultimately ends at the White House itself, Malone must not only battle Zorin, he must also confront his deepest fear, a crippling weakness that he's long denied but one that now jeopardizes everything. Steve Berry's trademark mix of fact, fiction, history and speculation, is all here, front and center, in this provocative new thriller. ...more", "number_review": "14", "category": "Thriller"},
{"title": "The Guilty (Will Robie #4)", "price": "13.82", "rating": "Two", "description": "Will Robie is the government's most professional, disciplined, and lethal assassin. He infiltrates the most hostile countries in the world, defeats our enemies' advanced security measures, and eliminates threats before they ever reach our shores. But now, his skills have left him. Sent overseas on a critical assignment, he fails, unable to pull the trigger. Absent his tale Will Robie is the government's most professional, disciplined, and lethal assassin. He infiltrates the most hostile countries in the world, defeats our enemies' advanced security measures, and eliminates threats before they ever reach our shores. But now, his skills have left him. Sent overseas on a critical assignment, he fails, unable to pull the trigger. Absent his talents, Robie is a man without a mission, and without a purpose.To recover what he has lost, Robie must confront what he has tried to forget for over twenty years: his own past. THE GUILTY Will Robie escaped his small Gulf Coast hometown of Cantrell, Mississippi after high school, severing all personal ties, and never looked back. Not once. Not until the unimaginable occurs. His father, Dan Robie, has been arrested and charged with murder.Father and son haven't spoken or seen each other since the day Robie left town. In that time, Dan Robie - a local attorney and pillar of the community-has been elected town judge. Despite this, most of Cantrell is aligned against Dan. His guilt is assumed.To make matters worse, Dan has refused to do anything to defend himself. When Robie tries to help, his father responds only with anger and defiance. Could Dan really be guilty?With the equally formidable Jessica Reel at his side, Robie ignores his father's wishes and begins his own desperate investigation into the case. But Robie is now a stranger to his hometown, an outsider, a man who has forsaken his past and his family. His attempts to save his father are met with distrust and skepticism . . . and violence.Unlike the missions Robie undertook in the service of his country, where his target was clearly defined, digging into his father's case only reveals more questions. Robie is drawn into the hidden underside of Cantrell, where he must face the unexpected and possibly deadly consequences of the long-ago choices made by father and son. And this time, there may be no escape for either of them. ...more", "number_review": "14", "category": "Thriller"},
{"title": "You (You #1)", "price": "43.61", "rating": "Five", "description": "When a beautiful, aspiring writer strides into the East Village bookstore where Joe Goldberg works, he does what anyone would do: he Googles the name on her credit card.There is only one Guinevere Beck in New York City. She has a public Facebook account and Tweets incessantly, telling Joe everything he needs to know: she is simply Beck to her friends, she went to Brown Uni When a beautiful, aspiring writer strides into the East Village bookstore where Joe Goldberg works, he does what anyone would do: he Googles the name on her credit card.There is only one Guinevere Beck in New York City. She has a public Facebook account and Tweets incessantly, telling Joe everything he needs to know: she is simply Beck to her friends, she went to Brown University, she lives on Bank Street, and she’ll be at a bar in Brooklyn tonight—the perfect place for a “chance” meeting.As Joe invisibly and obsessively takes control of Beck’s life, he orchestrates a series of events to ensure Beck finds herself in his waiting arms. Moving from stalker to boyfriend, Joe transforms himself into Beck’s perfect man, all while quietly removing the obstacles that stand in their way—even if it means murder. ...more", "number_review": "14", "category": "Thriller"},
{"title": "Behind Closed Doors", "price": "52.22", "rating": "Four", "description": "The 2016 debut bloggers can't stop raving about. Perfect for fans of The Girl on the Train and The Ice Twins Everyone knows a couple like Jack and Grace.He has looks and wealth, she has charm and elegance. You might not want to like them, but you do. Though, you’d like to get to know Grace better.But it’s difficult, because you realise Jack and Grace are never apart.Some The 2016 debut bloggers can't stop raving about. Perfect for fans of The Girl on the Train and The Ice Twins Everyone knows a couple like Jack and Grace.He has looks and wealth, she has charm and elegance. You might not want to like them, but you do. Though, you’d like to get to know Grace better.But it’s difficult, because you realise Jack and Grace are never apart.Some might call this true love. Others might ask why Grace never answers the phone. Or how she can never meet for coffee, even though she doesn’t work. How she can cook such elaborate meals but remain so slim. And why there are bars on one of the bedroom windows.Sometimes, the perfect marriage is the perfect lie. ...more", "number_review": "18", "category": "Thriller"},
{"title": "The Elephant Tree", "price": "23.82", "rating": "Five", "description": "Mark Fallon is an overworked detective investigating a spate of attacks at a string of high profile city centre nightclubs. Scott is a dejected 24 year old struggling to make ends meet working for his brother and supplementing his income with a small-scale drug dealing operation. Angela is an attractive 23 year old, raised by her father, a career criminal and small time dr Mark Fallon is an overworked detective investigating a spate of attacks at a string of high profile city centre nightclubs. Scott is a dejected 24 year old struggling to make ends meet working for his brother and supplementing his income with a small-scale drug dealing operation. Angela is an attractive 23 year old, raised by her father, a career criminal and small time drug dealer who supplies Scott with cannabis. This is a chilling tale spanning a few months in the lives of Scott and Angela, where realizations about the present combine with shocking revelations from the past leading to an apocalyptic climax where they no longer know whom they can trust. ...more", "number_review": "18", "category": "Thriller"},
{"title": "In Her Wake", "price": "12.84", "rating": "One", "description": "A perfect life … until she discovered it wasn’t her own.A tragic family event reveals devastating news that rips apart Bella’s comfortable existence. Embarking on a personal journey to uncover the truth, she faces a series of traumatic discoveries that take her to the ruggedly beautiful Cornish coast, where hidden truths, past betrayals and a 25-year-old mystery threaten n A perfect life … until she discovered it wasn’t her own.A tragic family event reveals devastating news that rips apart Bella’s comfortable existence. Embarking on a personal journey to uncover the truth, she faces a series of traumatic discoveries that take her to the ruggedly beautiful Cornish coast, where hidden truths, past betrayals and a 25-year-old mystery threaten not just her identity, but also her life.Chilling, complex and profoundly moving, In Her Wake is a gripping psychological thriller that questions the nature of family – and reminds us that sometimes the most shocking crimes are committed closest to home. ...more", "number_review": "19", "category": "Thriller"},
{"title": "Someone Like You (The Harrisons #2)", "price": "52.79", "rating": "Five", "description": "Pierce Harrison--yes, that Pierce Harrison, black sheep of the wealthy Harrison clan--has come home to his family's luxurious Long Island compound. The big question is why the dangerously sexy soccer star agreed to coach a kids' soccer team. His co-coach Abby McCord should be grateful. Instead she's fending off some seriously smoldering advances from the scandal-ridden ath Pierce Harrison--yes, that Pierce Harrison, black sheep of the wealthy Harrison clan--has come home to his family's luxurious Long Island compound. The big question is why the dangerously sexy soccer star agreed to coach a kids' soccer team. His co-coach Abby McCord should be grateful. Instead she's fending off some seriously smoldering advances from the scandal-ridden athlete. Good thing bad boys are so not her type . . . Abby is definitely not lacking in passion, but the sweet-faced beauty needs to learn a thing or two about taking a team to the championship--and a whole lot about how to let a man into her once-broken heart. Pierce definitely knows how to make the moves, but will Abby trust that the bachelor the world has condemned as a scoundrel can settle down with the one woman who has taken hold of his heart? ...more", "number_review": "14", "category": "Contemporary"},
{"title": "When We Collided", "price": "31.77", "rating": "One", "description": "We are seventeen and shattered and still dancing. We have messy, throbbing hearts, and we are stronger than anyone could ever know…Jonah never thought a girl like Vivi would come along.Vivi didn’t know Jonah would light up her world.Neither of them expected a summer like this…a summer that would rewrite their futures.In an unflinching story about new love, old wounds, and We are seventeen and shattered and still dancing. We have messy, throbbing hearts, and we are stronger than anyone could ever know…Jonah never thought a girl like Vivi would come along.Vivi didn’t know Jonah would light up her world.Neither of them expected a summer like this…a summer that would rewrite their futures.In an unflinching story about new love, old wounds, and forces beyond our control, two teens find that when you collide with the right person at just the right time, it will change you forever. ...more", "number_review": "16", "category": "Contemporary"},
{"title": "Unreasonable Hope: Finding Faith in the God Who Brings Purpose to Your Pain", "price": "46.33", "rating": "Two", "description": "Where was God when ____? How could God allow ____? Why? These are the questions that flood our hearts and minds when the unimaginable happens. When things go horribly wrong and the world seems to be unraveling, how do you believe in God s goodness? How do you cling to hope? Chad Veach directs readers away from cliched Sunday school answers that fail to offer real comfort o Where was God when ____? How could God allow ____? Why? These are the questions that flood our hearts and minds when the unimaginable happens. When things go horribly wrong and the world seems to be unraveling, how do you believe in God s goodness? How do you cling to hope? Chad Veach directs readers away from cliched Sunday school answers that fail to offer real comfort or provide faith-building insights. Instead, he draws from God s promises in the Bible and from the story of his own daughter s diagnosis of a devastating and debilitating disease to reveal simple, purposeful steps for dealing with pain. Resting in God s love, remembering his past faithfulness, and realizing the distinction between having faith and clinging to hope are just some of these steps. Veach reminds us that because we know who God is, we know there is hope.\" ...more", "number_review": "7", "category": "Spirituality"},
{"title": "If I Gave You God's Phone Number....: Searching for Spirituality in America", "price": "20.91", "rating": "One", "description": "If I Gave You God’s Phone Number… - Survey reveals people's relationships with their CreatorWhat do a Cherokee Medicine Woman, a Death Row inmate, an Afghani Sufi Mystic, a Catholic, a Jew, several praying kids, and Mare Cromwell have in common? They all feel strongly about who or what they think God is, why things happen the way they do, and what will become of us in the If I Gave You God’s Phone Number… - Survey reveals people's relationships with their CreatorWhat do a Cherokee Medicine Woman, a Death Row inmate, an Afghani Sufi Mystic, a Catholic, a Jew, several praying kids, and Mare Cromwell have in common? They all feel strongly about who or what they think God is, why things happen the way they do, and what will become of us in the future. They question, praise and criticize God in the hopes of better understanding themselves and others. In a world challenged by economic issues, climate change, war, and constant threat of terrorism, people are pausing from their daily routines to ask the deeper questions and wonder about the divine and mysterious nature of their Creator.In this book, author and spiritual seeker Mare Cromwell interviews people from all walks of life, asking, “If I gave you God’s phone number, what would you do with it?” This spiritual memoir, framed by twenty-one interviews with people from all walks of life, combines the oral tradition of Studs Terkel with the soulful searchings of Neale Donald Welsh. If I gave you God’s phone number… offers the reader what only the best books offer—windows into the most authentic reaches of the soul. Cromwell’s conscientious selection of interview subjects, and her deft questioning, which presses them to go deeper and deeper, is what lends the book its striking range. This diorama of spiritual postures—some passionate, some highly intellectualized—is impossible to look away from, infects the reader with a fever of curiosity about the human condition, and then proceeds to administer the careful cure: vivid, compelling testimony. Not only do her many subjects nourish the reader by their telling, but Cromwell too provides ongoing doses of self-revelation, a gesture of honesty that unifies and strengthens the whole picture. Reading If I gave you God’s phone number…. will enrich your view of spiritual life—in all its radiant variety—forever.What people are saying about If I gave you God’s phone number…\"I strongly recommend this engaging, thought-provoking book. It is distinguished by Ms. Cromwell's empathy for the interesting and diverse people she searched out to interview about their communication with God. Readers will be stimulated to reflect on their own spiritual journey as well as the author's own experiences and those of the people she has interviewed. Because of Ms. Cromwell's personal candor and insights, I continue to ponder the central question she asked her interviewees in this important and unusual book.\" –James Crowfoot, Ph.D., Professor and Dean Emeritus, University of Michigan and former President of Antioch College“Mare Cromwell has done a wonderful job of bringing people's personal views on God and spirituality to the public in this book. These stories will deepen our understanding of the diversity of spirituality in the human experience.”–Garrett Sarley, President of the Omega Institute, author of \"The Essentials of Yoga\" and \"Walking Yoga\"ABOUT THE AUTHOR: Mare Cromwell is an author, poet, gardener and environmentalist. A spiritual seeker for many years, she received a Masters in Natural Resources from the University of Michigan and worked internationally before starting this book. Seven years of interviewing along with a personal intensive search for spiritual meaning culminated in this treatise. Currently a professional gardener, Mare resides in Baltimore, Maryland, where she occasionally leads talks and workshops on spirituality, environmental sustainability and simplicity. ...more", "number_review": "9", "category": "Spirituality"},
{"title": "Chasing Heaven: What Dying Taught Me About Living", "price": "37.80", "rating": "Two", "description": "From the author of the New York Times bestseller, Waking Up in Heaven, comes an extraordinary story about Crystal McVea’s personal transformation after visiting heaven and how readers can experience heaven themselves—and live a more meaningful life.On December 10, 2009, Crystal McVea was being treated in a hospital for pancreatitis. Her heart stopped pumping for nine minut From the author of the New York Times bestseller, Waking Up in Heaven, comes an extraordinary story about Crystal McVea’s personal transformation after visiting heaven and how readers can experience heaven themselves—and live a more meaningful life.On December 10, 2009, Crystal McVea was being treated in a hospital for pancreatitis. Her heart stopped pumping for nine minutes before doctors managed to revive her. In those nine minutes, she went to heaven, stood with God, and was forever changed.Ever since Crystal’s incredible experience, her life has been profoundly different. She has become a brand new person in every conceivable way—heart, mind, soul, and spirit. By dying, Crystal learned how to live. Crystal realized that heaven is real and our true home, but we are still meant to have meaningful lives full of passion and purpose right here on earth. She believes we have to chase heaven while we are still alive and allow God to turn our lukewarm love into a firestorm of faith. Chasing Heaven is the story of how God called to Crystal, what He told her, and how she found a way to get closer to Him again here on earth.Crystal assures us that we don’t have to die and go to heaven in order to ignite our faith. We also don’t have to abandon the lives we have in order to experience God and heaven. Chasing Heaven is about following the path to the Lord, and discovering your spiritual destiny.The journey that followed Crystal’s time in heaven has been difficult, complicated, and surprising—full of twists and turns, setbacks and triumphs, drama and comedy, and everything that makes life so messy and beautiful. ...more", "number_review": "15", "category": "Spirituality"},
{"title": "The Activist's Tao Te Ching: Ancient Advice for a Modern Revolution", "price": "32.24", "rating": "Five", "description": "Change and anger are in the air. Looking for answers to today’s wrenching challenges, William Martin turns to the Tao Te Ching and finds that while Taoism is known for its quiet, enigmatic wisdom, the Tao can also have the cleansing force of a rushing river.Through his interpretation of this ancient Chinese text, Martin elucidates revolutionary messages condemning power-se Change and anger are in the air. Looking for answers to today’s wrenching challenges, William Martin turns to the Tao Te Ching and finds that while Taoism is known for its quiet, enigmatic wisdom, the Tao can also have the cleansing force of a rushing river.Through his interpretation of this ancient Chinese text, Martin elucidates revolutionary messages condemning power-seeking and greed. He emphasizes that humans have a “natural virtue” that can help them heal the planet; shows how Taoism’s simplicity can be subversive and its flexibility a potent force; and reassures that “when injustice is the rule, justice always lies in wait.”Provocative and stirring, Martin’s Tao flows within and through those who ride the waves of anger and frustration and gently guides them to true freedom.“We have learned the secret of transformation: Injustice feeds our determination. Hate increases our love. Wounds bring forth our healing, and fear uncovers our courage and serenity.”— from The Activist’s Tao Te Ching ...more", "number_review": "16", "category": "Spirituality"},
{"title": "The Four Agreements: A Practical Guide to Personal Freedom", "price": "17.66", "rating": "Five", "description": "In The Four Agreements, don Miguel Ruiz reveals the source of self-limiting beliefs that rob us of joy and create needless suffering. Based on ancient Toltec wisdom, the Four Agreements offer a powerful code of conduct that can rapidly transform our lives to a new experience of freedom, true happiness, and love. The Four Agreements are: Be Impeccable With Your Word, Don't In The Four Agreements, don Miguel Ruiz reveals the source of self-limiting beliefs that rob us of joy and create needless suffering. Based on ancient Toltec wisdom, the Four Agreements offer a powerful code of conduct that can rapidly transform our lives to a new experience of freedom, true happiness, and love. The Four Agreements are: Be Impeccable With Your Word, Don't Take Anything Personally, Don't Make Assumptions, Always Do Your Best. ...more", "number_review": "18", "category": "Spirituality"},
{"title": "You Are a Badass: How to Stop Doubting Your Greatness and Start Living an Awesome Life", "price": "12.08", "rating": "Three", "description": "Bestselling author, speaker, and success coach Jen Sincero cuts through the din of the self-help genre with her own verbal meat cleaver. Full of blunt humor, sage advice, and the occasional swear word, You are a Badass offers its readers new opportunities for growth through 35 chapters of exercises, suggestions, and hilariously inspiring stories.From \"Fear is for Suckers\" Bestselling author, speaker, and success coach Jen Sincero cuts through the din of the self-help genre with her own verbal meat cleaver. Full of blunt humor, sage advice, and the occasional swear word, You are a Badass offers its readers new opportunities for growth through 35 chapters of exercises, suggestions, and hilariously inspiring stories.From \"Fear is for Suckers\" to \"Your Brain is Your Bitch\" these chapters provide enlightening lessons: How to stop doubting your greatness, how to love what you don't love about yourself, and how to tap into source energy to live a bigger life than you've ever imagined. ...more", "number_review": "7", "category": "Self Help"},
{"title": "Overload: How to Unplug, Unwind, and Unleash Yourself from the Pressure of Stress", "price": "52.15", "rating": "Three", "description": "#1 New York Times bestselling author Joyce Meyer shows readers how to become free from the burden of stress so that they can achieve God's best for their lives. As technology increases your accessibility, it becomes harder to mute the background noise of your life and receive God's guidance. Joyce Meyer calls this OVERLOAD, when the demands of your busy life become all-con #1 New York Times bestselling author Joyce Meyer shows readers how to become free from the burden of stress so that they can achieve God's best for their lives. As technology increases your accessibility, it becomes harder to mute the background noise of your life and receive God's guidance. Joyce Meyer calls this OVERLOAD, when the demands of your busy life become all-consuming and overwhelming. But to experience the joyful life God has planned, you must make time to focus on His Word. Then you'll receive His healing calmness and gain the strength to take on life's challenges, from physical ailments to problems in relationships. Through the practical advice and Scriptural wisdom in this book, you'll learn how to unplug and free yourself from burdens that weigh you down. You'll gain simple, effective tips for better rest and stress management and discover the fulfilling life you were meant to lead. ...more", "number_review": "14", "category": "Self Help"},
{"title": "How to Be Miserable: 40 Strategies You Already Use", "price": "46.03", "rating": "One", "description": "In How to Be Miserable, psychologist Randy Paterson outlines 40 specific behaviors and habits, which—if followed—are sure to lead to a lifetime of unhappiness. On the other hand, if you do the opposite, you may yet join the ranks of happy people everywhere!There are stacks upon stacks of self-help books that will promise you love, happiness, and a fabulous life. But how ca In How to Be Miserable, psychologist Randy Paterson outlines 40 specific behaviors and habits, which—if followed—are sure to lead to a lifetime of unhappiness. On the other hand, if you do the opposite, you may yet join the ranks of happy people everywhere!There are stacks upon stacks of self-help books that will promise you love, happiness, and a fabulous life. But how can you pinpoint the exact behaviors that cause you to be miserable in the first place? Sometimes when we’re depressed, or just sad or unhappy, our instincts tell us to do the opposite of what we should—such as focusing on the negative, dwelling on what we can’t change, isolating ourselves from friends and loved ones, eating junk food, or overindulging in alcohol. Sound familiar?This tongue-in-cheek guide will help you identify the behaviors that make you unhappy and discover how you—and only you—are holding yourself back from a life of contentment. You’ll learn to spot the tried-and-true traps that increase feelings of dissatisfaction, foster a lack of motivation, and detract from our quality of life—as well as ways to avoid them.So, get ready to live the life you want (or not?) This fun, irreverent guide will light the way. ...more", "number_review": "16", "category": "Self Help"},
{"title": "Online Marketing for Busy Authors: A Step-By-Step Guide", "price": "46.35", "rating": "One", "description": "If You Want People to Read Your Book, Writing It Is Only the Beginning There has truly never been a better time to be an author. For the first time, authors have direct access to the public via the Internet and can create a community eagerly awaiting their book. But where do new authors start? How do they sort through the dizzying range of online options? Where should they If You Want People to Read Your Book, Writing It Is Only the Beginning There has truly never been a better time to be an author. For the first time, authors have direct access to the public via the Internet and can create a community eagerly awaiting their book. But where do new authors start? How do they sort through the dizzying range of online options? Where should they spend their time online and what should they be doing? Enter Fauzia Burke, a digital book marketing pioneer and friend of overwhelmed writers everywhere. She takes authors step-by-step through the process of identifying their unique personal brand, defining their audience, clarifying their aspirations and goals, and setting priorities. She offers advice on designing a successful website, building a mailing list of superfans, blogging, creating an engagement strategy for social media, and more. By following Burke's expert advice, authors can conquer the Internet and still get their next manuscript in on time. \" ...more", "number_review": "16", "category": "Self Help"},
{"title": "All the Light We Cannot See", "price": "29.87", "rating": "Five", "description": "WINNER OF THE PULITZER PRIZEFrom the highly acclaimed, multiple award-winning Anthony Doerr, the beautiful, stunningly ambitious instant New York Times bestseller about a blind French girl and a German boy whose paths collide in occupied France as both try to survive the devastation of World War II.Marie-Laure lives with her father in Paris near the Museum of Natural Histo WINNER OF THE PULITZER PRIZEFrom the highly acclaimed, multiple award-winning Anthony Doerr, the beautiful, stunningly ambitious instant New York Times bestseller about a blind French girl and a German boy whose paths collide in occupied France as both try to survive the devastation of World War II.Marie-Laure lives with her father in Paris near the Museum of Natural History, where he works as the master of its thousands of locks. When she is six, Marie-Laure goes blind and her father builds a perfect miniature of their neighborhood so she can memorize it by touch and navigate her way home. When she is twelve, the Nazis occupy Paris and father and daughter flee to the walled citadel of Saint-Malo, where Marie-Laure’s reclusive great-uncle lives in a tall house by the sea. With them they carry what might be the museum’s most valuable and dangerous jewel.In a mining town in Germany, the orphan Werner grows up with his younger sister, enchanted by a crude radio they find. Werner becomes an expert at building and fixing these crucial new instruments, a talent that wins him a place at a brutal academy for Hitler Youth, then a special assignment to track the resistance. More and more aware of the human cost of his intelligence, Werner travels through the heart of the war and, finally, into Saint-Malo, where his story and Marie-Laure’s converge.Doerr’s “stunning sense of physical detail and gorgeous metaphors” (San Francisco Chronicle) are dazzling. Deftly interweaving the lives of Marie-Laure and Werner, he illuminates the ways, against all odds, people try to be good to one another. Ten years in the writing, a National Book Award finalist, All the Light We Cannot See is a magnificent, deeply moving novel from a writer “whose sentences never fail to thrill” (Los Angeles Times). ...more", "number_review": "14", "category": "Historical"},
{"title": "Crazy Love: Overwhelmed by a Relentless God", "price": "47.72", "rating": "Two", "description": "Have you ever wondered if we're missing it? It's crazy, if you think about it. The God of the universe—the Creator of nitrogen and pine needles, galaxies and E-minor—loves us with a radical, unconditional, self-sacrificing love. And what is our typical response? We go to church, sing songs, and try not to cuss. Whether you've verbalized it yet or not, we all know something Have you ever wondered if we're missing it? It's crazy, if you think about it. The God of the universe—the Creator of nitrogen and pine needles, galaxies and E-minor—loves us with a radical, unconditional, self-sacrificing love. And what is our typical response? We go to church, sing songs, and try not to cuss. Whether you've verbalized it yet or not, we all know something's wrong. Does something deep inside your heart long to break free from the status quo? Are you hungry for an authentic faith that addresses the problems of our world with tangible, even radical, solutions? God is calling you to a passionate love relationship with Himself. Because the answer to religious complacency isn't working harder at a list of do's and don'ts-it's falling in love with God. And once you encounter His love, as Francis describes it, you will never be the same. Because when you're wildly in love with someone, it changes everything. Learn more about Crazy Love at www.crazylovebook.com ...more", "number_review": "14", "category": "Christian"},
{"title": "(Un)Qualified: How God Uses Broken People to Do Big Things", "price": "54.00", "rating": "Five", "description": "Who You Think You Are is Not as Important as Who God Says You AreMany of us wrestle with the gap between our weaknesses and our dreams, between who we are and who God says we are meant to be. We feel unqualified to do God’s work or to live out the calling we imagine. But God has a way of using our weaknesses for good. In fact, God loves unqualified people.In (Un)Qualified, Who You Think You Are is Not as Important as Who God Says You AreMany of us wrestle with the gap between our weaknesses and our dreams, between who we are and who God says we are meant to be. We feel unqualified to do God’s work or to live out the calling we imagine. But God has a way of using our weaknesses for good. In fact, God loves unqualified people.In (Un)Qualified, Pastor Steven Furtick helps you peel back the assumptions you’ve made about yourself and see yourself as God sees you. Because true peace and confidence come not from worldly perfection but from acceptance: God’s acceptance of you, your acceptance of yourself, and your acceptance of God’s process of change.This is a book about understanding your identity in light of who God is. It’s a book about coming to terms with the good, the bad, and the unmentionable in your life and learning to let God use you. It’s about charging into the gap between your present and your hopes and meeting God there. After all, God can’t bless who you pretend to be. But he longs to bless who you really are; a flawed and broken person. Good thing for us that God is in the business of using broken people to do big things. Being Unqualified Is God’s Favorite QualificationOur culture tells us that the answer to our failures is to fix them. The solution to our weaknesses is to hide them. The secret to our success is to appear as flawless as possible. But God’s qualifying system is different than the world’s. So is his view of our weaknesses, our purpose, and our true selves.In (Un)Qualified, Steven Furtick explores who God is as the great “I AM,” and then helps us discover our own identity. Delving into the story of Jacob, Furtick invites us to acknowledge our weaknesses and ask God to work through them.The truth is, God has created us to be more, to accomplish more, and to love life more than we ever thought possible. But to become who he has called us to be, we must embrace who we are right now. (Un)Qualified equips us to face obstacles and failures without losing a sense of purpose. We can have a thriving sense of hope that God is working in us and through us, not in spite of our weaknesses but often as a direct result of them. ...more", "number_review": "16", "category": "Christian"},
{"title": "10-Day Green Smoothie Cleanse: Lose Up to 15 Pounds in 10 Days!", "price": "49.71", "rating": "Five", "description": "The 10-Day Green Smoothie Cleanse will jump-start your weight loss, increase your energy level, clear your mind, and improve your overall health. Made up of supernutrients from leafy greens and fruits, green smoothies are filling and healthy and you will enjoy drinking them. Your body will also thank you for drinking them as your health and energy improve to levels you nev The 10-Day Green Smoothie Cleanse will jump-start your weight loss, increase your energy level, clear your mind, and improve your overall health. Made up of supernutrients from leafy greens and fruits, green smoothies are filling and healthy and you will enjoy drinking them. Your body will also thank you for drinking them as your health and energy improve to levels you never thought possible. In ten days, you can expect to lose weight, reduce cravings, clear your mind, and improve digestion. It is an experience that could change your life if you stick with it! This book provides a shopping list, recipes, and detailed instructions for the 10-day cleanse, along with suggestions for getting the best results. It also offers advice on how to continue to lose weight and maintain good health afterwards. Are you ready to look slimmer, healthier, and sexier than you have in years? Then get ready to begin the 10-Day Green Smoothie Cleanse! If you successfully complete the 10-Day Green Smoothie Cleanse, you will… - Lose 10‒15 pounds in 10 days - Get rid of stubborn body fat, including belly fat - Drop pounds and inches fast, without grueling workouts - Learn to live a healthier lifestyle of detoxing and healthy eating - Help your body naturally crave healthy foods so you never have to diet again - Receive over 100 green smoothie recipes for various health conditions and goals JJ Smith is the author of the #1 national bestseller and USA Today bestseller Lose Weight Without Dieting or Working Out! JJ Smith is a nutritionist and certified weight-loss expert who has been featured on The Steve Harvey Show, The Montel Williams Show, and The Jamie Foxx Show and on the NBC, FOX, and CW Network television stations, as well as in the pages of Glamour, Essence, and Ladies Home Journal. Since reclaiming her health, losing weight, and discovering a “second youth” in her forties, JJ has become the voice of inspiration to those who want to lose weight, be healthy, and get their sexy back! ...more", "number_review": "10", "category": "Health"},
{"title": "Eat Fat, Get Thin", "price": "54.07", "rating": "Two", "description": "Originally released by Hachettee Audio A2015.", "number_review": "14", "category": "Health"},
{"title": "The Bulletproof Diet: Lose up to a Pound a Day, Reclaim Energy and Focus, Upgrade Your Life", "price": "49.05", "rating": "Three", "description": "In his midtwenties, Dave Asprey was a successful Silicon Valley multimillionaire. He also weighed 300 pounds, despite the fact that he was doing what doctors recommended: eating 1,800 calories a day and working out 90 minutes a day, six times a week. When his excess fat started causing brain fog and food cravings sapped his energy and willpower, Asprey turned to the same h In his midtwenties, Dave Asprey was a successful Silicon Valley multimillionaire. He also weighed 300 pounds, despite the fact that he was doing what doctors recommended: eating 1,800 calories a day and working out 90 minutes a day, six times a week. When his excess fat started causing brain fog and food cravings sapped his energy and willpower, Asprey turned to the same hacking techniques that made his fortune to \"hack\" his own biology, investing more than $300,000 and 15 years to uncover what was hindering his energy, performance, appearance, and happiness. From private brain EEG facilities to remote monasteries in Tibet, through radioactive brain scans, blood chemistry work, nervous system testing, and more, he explored traditional and alternative technologies to reach his physical and mental prime. The result? The Bulletproof Diet, an anti-inflammatory program for hunger-free, rapid weight loss and peak performance. The Bulletproof Diet will challenge—and change—the way you think about weight loss and wellness. You will skip breakfast, stop counting calories, eat high levels of healthy saturated fat, work out and sleep less, and add smart supplements.In doing so, you'll gain energy, build lean muscle, and watch the pounds melt off. By ditching traditional \"diet\" thinking, Asprey went from being overweight and sick in his twenties to maintaining a 100-pound weight loss, increasing his IQ, and feeling better than ever in his forties. The Bulletproof Diet is your blueprint to a better life. ...more", "number_review": "16", "category": "Health"},
{"title": "Why the Right Went Wrong: Conservatism--From Goldwater to the Tea Party and Beyond", "price": "52.65", "rating": "Four", "description": "“Dionne's expertise is evident in this finely crafted and convincing work.” —The Los Angeles TimesFrom one of our most engaging political reporters and the author of Why Americans Hate Politics; the story of conservatism from the Goldwater 1960s to the present day Tea Party that has resulted in broken promises and an ideological purity that drives moderate Republicans away “Dionne's expertise is evident in this finely crafted and convincing work.” —The Los Angeles TimesFrom one of our most engaging political reporters and the author of Why Americans Hate Politics; the story of conservatism from the Goldwater 1960s to the present day Tea Party that has resulted in broken promises and an ideological purity that drives moderate Republicans away.Why the Right Went Wrong offers a historical view of the right since the 1960s. Its core contention is that American conservatism and the Republican Party took a wrong turn when they adopted Barry Goldwater’s worldview during and after the 1964 campaign. The radicalism of today’s conservatism is not the product of the Tea Party, Washington Post columnist E.J. Dionne writes. The Tea Partiers are the true heirs to Goldwater ideology. The purity movement did more than drive moderates out of the Republican Party—it beat back alternative definitions of conservatism.Since 1968, no conservative administration—not Nixon not Reagan not two Bushes—could live up to the rhetoric rooted in the Goldwater movement that began to reshape American politics fifty years ago. The collapse of the Nixon presidency led to the rise of Ronald Reagan, the defeat of George H.W. Bush, to Newt Gingrich’s revolution. Bush initially undertook a partial modernization, preaching “compassionate conservatism” and a “Fourth Way” to Clinton’s “Third Way.” Conservatives quickly defined him as an advocate of “big government” and not conservative enough on spending, immigration, education, and Medicare. A return to the true faith was the only prescription on order. The result was the Tea Party, which Dionne says, was as much a reaction to Bush as to Obama.The state of the Republican party, controlled by the strictest base, is diminished, Dionne writes. It has become white and older in a country that is no longer that. It needs to come back to life for its own health and that of the country’s, and in Why the Right Went Wrong, he explains how. ...more", "number_review": "14", "category": "Politics"},
{"title": "Libertarianism for Beginners", "price": "51.33", "rating": "Two", "description": "Libertarianism isn't about winning elections; it is first and foremost a political philosophy--a description of how, in the opinion of libertarians, free people ought to treat one another, at least when they use the law, which they regard as potentially dangerous. If libertarians are correct, the law should intrude into people's lives as little as possible, rarely telling Libertarianism isn't about winning elections; it is first and foremost a political philosophy--a description of how, in the opinion of libertarians, free people ought to treat one another, at least when they use the law, which they regard as potentially dangerous. If libertarians are correct, the law should intrude into people's lives as little as possible, rarely telling them what to do or how to live.A political and economic philosophy as old as John Locke and John Stuart Mill, but as alive and timely as Rand Paul, the Tea Party, and the novels of Ayn Rand, libertarianism emphasizes individual rights and calls for a radical reduction in the power and size of government. \"Libertarianism For Beginners\" lays out the history and principles of this often-misunderstood philosophy in lucid, dispassionate terms that help illuminate today's political dialogue.\" ...more", "number_review": "19", "category": "Politics"},
{"title": "If I Run (If I Run #1)", "price": "49.97", "rating": "Four", "description": "Casey knows the truth.But it won’t set her free.Casey Cox’s DNA is all over the crime scene. There’s no use talking to police; they have failed her abysmally before. She has to flee before she’s arrested . . . or worse. The truth doesn’t matter anymore.But what is the truth? That’s the question haunting Dylan Roberts, the war-weary veteran hired to find Casey. PTSD has mar Casey knows the truth.But it won’t set her free.Casey Cox’s DNA is all over the crime scene. There’s no use talking to police; they have failed her abysmally before. She has to flee before she’s arrested . . . or worse. The truth doesn’t matter anymore.But what is the truth? That’s the question haunting Dylan Roberts, the war-weary veteran hired to find Casey. PTSD has marked him damaged goods, but bringing Casey back can redeem him. Though the crime scene seems to tell the whole story, details of the murder aren’t adding up. Casey Cox doesn’t fit the profile of a killer. But are Dylan’s skewed perceptions keeping him from being objective? If she isn’t guilty, why did she run?Unraveling her past and the evidence that condemns her will take more time than he has, but as Dylan’s damaged soul intersects with hers, he is faced with two choices. The girl who occupies his every thought is a psychopathic killer . . . or a selfless hero. And the truth could be the most deadly weapon yet. ...more", "number_review": "3", "category": "Christian Fiction"},
{"title": "House of Lost Worlds: Dinosaurs, Dynasties, and the Story of Life on Earth", "price": "43.70", "rating": "Two", "description": "This fascinating book tells the story of how one museum changed ideas about dinosaurs, dynasties, and even the story of life on earth. The Yale Peabody Museum of Natural History, now celebrating its 150th anniversary, has remade the way we see the world. Delving into the museum’s storied and colorful past, award-winning author Richard Conniff introduces a cast of bold expl This fascinating book tells the story of how one museum changed ideas about dinosaurs, dynasties, and even the story of life on earth. The Yale Peabody Museum of Natural History, now celebrating its 150th anniversary, has remade the way we see the world. Delving into the museum’s storied and colorful past, award-winning author Richard Conniff introduces a cast of bold explorers, roughneck bone hunters, and visionary scientists. Some became famous for wresting Brontosaurus, Triceratops, and other dinosaurs from the earth, others pioneered the introduction of science education in North America, and still others rediscovered the long-buried glory of Machu Picchu.   In this lively tale of events, achievements, and scandals from throughout the museum’s history. Readers will encounter renowned paleontologist O. C. Marsh who engaged in ferocious combat with his “Bone Wars” rival Edward Drinker Cope, as well as dozens of other intriguing characters. Nearly 100 color images portray important figures in the Peabody’s history and special objects from the museum’s 13-million-item collections. For anyone with an interest in exploring, understanding, and protecting the natural world, this book will deliver abundant delights. ...more", "number_review": "3", "category": "History"},
{"title": "House of Leaves", "price": "54.89", "rating": "One", "description": "Years ago, when House of Leaves was first being passed around, it was nothing more than a badly bundled heap of paper, parts of which would occasionally surface on the Internet. No one could have anticipated the small but devoted following this terrifying story would soon command. Starting with an odd assortment of marginalized youth -- musicians, tattoo artists, programme Years ago, when House of Leaves was first being passed around, it was nothing more than a badly bundled heap of paper, parts of which would occasionally surface on the Internet. No one could have anticipated the small but devoted following this terrifying story would soon command. Starting with an odd assortment of marginalized youth -- musicians, tattoo artists, programmers, strippers, environmentalists, and adrenaline junkies -- the book eventually made its way into the hands of older generations, who not only found themselves in those strangely arranged pages but also discovered a way back into the lives of their estranged children.Now, for the first time, this astonishing novel is made available in book form, complete with the original colored words, vertical footnotes, and newly added second and third appendices.The story remains unchanged, focusing on a young family that moves into a small home on Ash Tree Lane where they discover something is terribly wrong: their house is bigger on the inside than it is on the outside.Of course, neither Pulitzer Prize-winning photojournalist Will Navidson nor his companion Karen Green was prepared to face the consequences of that impossibility, until the day their two little children wandered off and their voices eerily began to return another story -- of creature darkness, of an ever-growing abyss behind a closet door, and of that unholy growl which soon enough would tear through their walls and consume all their dreams. ...more", "number_review": "3", "category": "Horror"},
{"title": "Holidays on Ice", "price": "51.07", "rating": "Two", "description": "A new holiday classic--six of the most profound Christmas stories by the author of the bestselling \"Naked\" and \"Barrel Fever\"--is now in a paperback edition perfect for stocking stuffing.", "number_review": "3", "category": "Humor"},
{"title": "Fifty Shades Freed (Fifty Shades #3)", "price": "15.36", "rating": "Five", "description": "When unworldly student Anastasia Steele first encountered the driven and dazzling young entrepreneur Christian Grey it sparked a sensual affair that changed both of their lives irrevocably. Shocked, intrigued, and, ultimately, repelled by Christian’s singular erotic tastes, Ana demands a deeper commitment. Determined to keep her, Christian agrees.Now, Ana and Christian hav When unworldly student Anastasia Steele first encountered the driven and dazzling young entrepreneur Christian Grey it sparked a sensual affair that changed both of their lives irrevocably. Shocked, intrigued, and, ultimately, repelled by Christian’s singular erotic tastes, Ana demands a deeper commitment. Determined to keep her, Christian agrees.Now, Ana and Christian have it all—love, passion, intimacy, wealth, and a world of possibilities for their future. But Ana knows that loving her Fifty Shades will not be easy, and that being together will pose challenges that neither of them would anticipate. Ana must somehow learn to share Christian’s opulent lifestyle without sacrificing her own identity. And Christian must overcome his compulsion to control as he wrestles with the demons of a tormented past.Just when it seems that their strength together will eclipse any obstacle, misfortune, malice, and fate conspire to make Ana’s deepest fears turn to reality.This book is intended for mature audiences. ...more", "number_review": "3", "category": "Adult Fiction"},
{"title": "Catastrophic Happiness: Finding Joy in Childhood's Messy Years", "price": "37.35", "rating": "Two", "description": "A comic and heartwarming memoir about childhood's second act from Real Simple journalist Catherine Newman. Much is written about a child's infancy and toddler years, which is good since children will never remember it themselves. It is ages 4-14 that make up the second act, as Catherine Newman puts it in this delightfully candid, outlandishly funny new memoir about the yea A comic and heartwarming memoir about childhood's second act from Real Simple journalist Catherine Newman. Much is written about a child's infancy and toddler years, which is good since children will never remember it themselves. It is ages 4-14 that make up the second act, as Catherine Newman puts it in this delightfully candid, outlandishly funny new memoir about the years that \"your children will remember as childhood.\" Following Newman's son and daughter as they blossom from preschoolers into teenagers, CATASTROPHIC HAPPINESS is about the bittersweet joy of raising children--and the ever-evolving landscape of issues parents traverse. In a laugh out-loud, heart-wrenching, relatable voice, Newman narrates events as momentous as grief and as quietly moving as the moonlit face of a sleeping child. From tantrums and friendship to fear and even sex, Newman's fresh take will appeal to any parent riding this same roller coaster of laughter and heartbreak. ...more", "number_review": "3", "category": "Parenting"},
{"title": "A Heartbreaking Work of Staggering Genius", "price": "54.29", "rating": "Five", "description": "Dave Eggers is a terrifically talented writer; don't hold his cleverness against him. What to make of a book called A Heartbreaking Work of Staggering Genius: Based on a True Story? For starters, there's a good bit of staggering genius before you even get to the true story, including a preface, a list of \"Rules and Suggestions for Enjoyment of This Book,\" and a 20-page ack Dave Eggers is a terrifically talented writer; don't hold his cleverness against him. What to make of a book called A Heartbreaking Work of Staggering Genius: Based on a True Story? For starters, there's a good bit of staggering genius before you even get to the true story, including a preface, a list of \"Rules and Suggestions for Enjoyment of This Book,\" and a 20-page acknowledgements section complete with special mail-in offer, flow chart of the book's themes, and a lovely pen-and-ink drawing of a stapler (helpfully labeled \"Here is a drawing of a stapler:\"). But on to the true story. At the age of 22, Eggers became both an orphan and a \"single mother\" when his parents died within five months of one another of unrelated cancers. In the ensuing sibling division of labor, Dave is appointed unofficial guardian of his 8-year-old brother, Christopher. The two live together in semi-squalor, decaying food and sports equipment scattered about, while Eggers worries obsessively about child-welfare authorities, molesting babysitters, and his own health. His child-rearing strategy swings between making his brother's upbringing manically fun and performing bizarre developmental experiments on him. (Case in point: his idea of suitable bedtime reading is John Hersey's Hiroshima.) The book is also, perhaps less successfully, about being young and hip and out to conquer the world (in an ironic, media-savvy, Gen-X way, naturally). In the early '90s, Eggers was one of the founders of the very funny Might Magazine, and he spends a fair amount of time here on Might, the hipster culture of San Francisco's South Park, and his own efforts to get on to MTV's Real World. This sort of thing doesn't age very well--but then, Eggers knows that. There's no criticism you can come up with that he hasn't put into A.H.W.O.S.G. already. \"The book thereafter is kind of uneven,\" he tells us regarding the contents after page 109, and while that's true, it's still uneven in a way that is funny and heartfelt and interesting. All this self-consciousness could have become unbearably arch. It's a testament to Eggers's skill as a writer--and to the heartbreaking particulars of his story--that it doesn't. Currently the editor of the footnote-and-marginalia-intensive journal McSweeney's (the last issue featured an entire story by David Foster Wallace printed tinily on its spine), Eggers comes from the most media-saturated generation in history--so much so that he can't feel an emotion without the sense that it's already been felt for him. What may seem like postmodern noodling is really just Eggers writing about pain in the only honest way available to him. Oddly enough, the effect is one of complete sincerity, and--especially in its concluding pages--this memoir as metafiction is affecting beyond all rational explanation. --Mary Park ...more", "number_review": "3", "category": "Autobiography"},
{"title": "8 Keys to Mental Health Through Exercise", "price": "31.04", "rating": "One", "description": "We all know that exercise is good for physical health. Improved fitness has been proven to increase longevity and stave off illness. Recently, there has been a wealth of data proving that exercise also contributes to overall mental well-being. Routine exercise alleviates stress and anxiety, moderates depression, relieves chronic pain, and improves self-esteem.Christina G. We all know that exercise is good for physical health. Improved fitness has been proven to increase longevity and stave off illness. Recently, there has been a wealth of data proving that exercise also contributes to overall mental well-being. Routine exercise alleviates stress and anxiety, moderates depression, relieves chronic pain, and improves self-esteem.Christina G. Hibbert, an expert on women’s mental health, grief, and self-esteem issues, here offers readers step-by-step strategies for sticking to fitness goals, overcoming motivation challenges and roadblocks to working out, and maintaining a physically and emotionally healthy exercise regimen. The techniques she offers will benefit readers at any stage of life or fitness level. Whether you have worked out periodically in the past or have never hit the gym, this book will help you get moving, stay moving, and maintain the inspiration you need to reap the mental health benefits of regular exercise. ...more", "number_review": "3", "category": "Psychology"},
{"title": "Ways of Seeing", "price": "39.51", "rating": "Five", "description": "John Berger’s Classic Text on ArtJohn Berger's Ways of Seeing is one of the most stimulating and the most influential books on art in any language. First published in 1972, it was based on the BBC television series about which the (London) Sunday Times critic commented: \"This is an eye-opener in more ways than one: by concentrating on how we look at paintings . . . he will John Berger’s Classic Text on ArtJohn Berger's Ways of Seeing is one of the most stimulating and the most influential books on art in any language. First published in 1972, it was based on the BBC television series about which the (London) Sunday Times critic commented: \"This is an eye-opener in more ways than one: by concentrating on how we look at paintings . . . he will almost certainly change the way you look at pictures.\" By now he has.\"Berger has the ability to cut right through the mystification of the professional art critics . . . He is a liberator of images: and once we have allowed the paintings to work on us directly, we are in a much better position to make a meaningful evaluation\" —Peter Fuller, Arts Review\"The influence of the series and the book . . . was enormous . . . It opened up for general attention to areas of cultural study that are now commonplace\" —Geoff Dyer in Ways of TellingWinner of the 1972 Booker Prize for his novel, G., John Peter Berger (born November 5th, 1926) is an art critic, painter and author of many novels including A Painter of Our Time, From A to X and Bento’s Sketchbook. ...more", "number_review": "1", "category": "Art"},
{"title": "Vampire Knight, Vol. 1 (Vampire Knight #1)", "price": "15.40", "rating": "One", "description": "Yuki Cross has no memory of her past prior to the moment she was saved from a vampire attack ten years ago. She was adopted by the headmaster of Cross Academy, and now works alongside Zero to guard the Academy's secret. Cross Adademy is attended by two groups of students: the Day Class and the Night Class. At twilight, when the students of the Day Class return to their dor Yuki Cross has no memory of her past prior to the moment she was saved from a vampire attack ten years ago. She was adopted by the headmaster of Cross Academy, and now works alongside Zero to guard the Academy's secret. Cross Adademy is attended by two groups of students: the Day Class and the Night Class. At twilight, when the students of the Day Class return to their dorm, they cross paths with the Night Class on their way to school. Yuki Cross and Zero Kiryu are the Guardians of the school, protecting the Day Class from the Academy's dark secret: the Night Class is full of vampires! ...more", "number_review": "1", "category": "Paranormal"},
{"title": "Twenty Love Poems and a Song of Despair", "price": "30.95", "rating": "Four", "description": "Drawn from the most intimate and personal associations, Pablo Neruda's most beloved collection of poetry juxtaposes the exuberance of youthful passion with the desolation of grief, the sensuality of the body with the metaphorical nuances of nature. Pulitzer Prize-winning poet W. S. Merwin's masterly translation faces the original Spanish text. This edition also features an Drawn from the most intimate and personal associations, Pablo Neruda's most beloved collection of poetry juxtaposes the exuberance of youthful passion with the desolation of grief, the sensuality of the body with the metaphorical nuances of nature. Pulitzer Prize-winning poet W. S. Merwin's masterly translation faces the original Spanish text. This edition also features an insightful Introduction by Cristina Garcia. More than eighty years after its publication, Twenty Love Poems and a Song of Despair stands as an essential collection that continues to inspire lovers and poets around the world. ...more", "number_review": "1", "category": "Poetry"},
{"title": "The Selfish Gene", "price": "29.45", "rating": "One", "description": "Richard Dawkins' brilliant reformulation of the theory of natural selection has the rare distinction of having provoked as much excitement and interest outside the scientific community as within it. His theories have helped change the whole nature of the study of social biology, and have forced thousands of readers to rethink their beliefs about life. In his internationall Richard Dawkins' brilliant reformulation of the theory of natural selection has the rare distinction of having provoked as much excitement and interest outside the scientific community as within it. His theories have helped change the whole nature of the study of social biology, and have forced thousands of readers to rethink their beliefs about life. In his internationally bestselling, now classic volume, The Selfish Gene, Dawkins explains how the selfish gene can also be a subtle gene. The world of the selfish gene revolves around savage competition, ruthless exploitation, and deceit, and yet, Dawkins argues, acts of apparent altruism do exist in nature. Bees, for example, will commit suicide when they sting to protect the hive, and birds will risk their lives to warn the flock of an approaching hawk. This 30th anniversary edition of Dawkins' fascinating book retains all original material, including the two enlightening chapters added in the second edition. In a new Introduction the author presents his thoughts thirty years after the publication of his first and most famous book, while the inclusion of the two-page original Foreword by brilliant American scientist Robert Trivers shows the enthusiastic reaction of the scientific community at that time. This edition is a celebration of a remarkable exposition of evolutionary thought, a work that has been widely hailed for its stylistic brilliance and deep scientific insights, and that continues to stimulate whole new areas of research today. ...more", "number_review": "1", "category": "Science"},
{"title": "Off Sides (Off #1)", "price": "39.45", "rating": "Five", "description": "“I'm not sure what possessed me to do it. Maybe it was the impossible expectations I faced, maybe it was my own self-loathing. But I just knew I needed something different to happen. I needed someone... something... to derail me from my current path. Otherwise, I would become lost... a hollowed out shell of a man. So I did it. I approached her, then I pursued her, then I m “I'm not sure what possessed me to do it. Maybe it was the impossible expectations I faced, maybe it was my own self-loathing. But I just knew I needed something different to happen. I needed someone... something... to derail me from my current path. Otherwise, I would become lost... a hollowed out shell of a man. So I did it. I approached her, then I pursued her, then I made her mine. And my life was saved...”Ryan Burnham is the privileged son of a U.S. Congressman and captain of his university’s hockey team. While he is on the verge of fulfilling his dreams to play in the NHL, his parents want him on a different course. One he is expected to accept for the sake of his family’s public image.Forced her to abandon her music career after the heart breaking death of her parents, Danny Cross exists on the opposite side of the tracks from Ryan. She is struggling to make her own way, working two jobs, attending college part time and volunteering in a homeless shelter. She is on a mission to build her own success.With a chance meeting, their vastly different worlds collide, causing each to evaluate whether they are truly on the correct path to self-fulfillment and happiness. Can their relationship survive? Particularly when others are against them every step of the way. A lot can happen in just ten short days... ...more", "number_review": "1", "category": "New Adult"},
{"title": "The Midnight Watch: A Novel of the Titanic and the Californian", "price": "26.20", "rating": "One", "description": "As the Titanic and her passengers sank slowly into the Atlantic Ocean after striking an iceberg late in the evening of April 14, 1912, a nearby ship looked on. Second Officer Herbert Stone, in charge of the midnight watch on the SS Californian sitting idly a few miles north, saw the distress rockets that the Titanic fired. He alerted the captain, Stanley Lord, who was slee As the Titanic and her passengers sank slowly into the Atlantic Ocean after striking an iceberg late in the evening of April 14, 1912, a nearby ship looked on. Second Officer Herbert Stone, in charge of the midnight watch on the SS Californian sitting idly a few miles north, saw the distress rockets that the Titanic fired. He alerted the captain, Stanley Lord, who was sleeping in the chartroom below, but Lord did not come to the bridge. Eight rockets were fired during the dark hours of the midnight watch, and eight rockets were ignored. The next morning, the Titanic was at the bottom of the sea and more than 1,500 people were dead. When they learned of the extent of the tragedy, Lord and Stone did everything they could to hide their role in the disaster, but pursued by newspapermen, lawyers, and political leaders in America and England, their terrible secret was eventually revealed. The Midnight Watch is a fictional telling of what may have occurred that night on the SS Californian, and the resulting desperation of Officer Stone and Captain Lord in the aftermath of their inaction.Told not only from the perspective of the SS Californian crew, but also through the eyes of a family of third-class passengers who perished in the disaster, the narrative is drawn together by Steadman, a tenacious Boston journalist who does not rest until the truth is found. The Midnight Watch is a powerful and dramatic debut novel--the result of many years of research in Liverpool, London, New York, and Boston, and informed by the author's own experiences as a ship's officer and a lawyer. ...more", "number_review": "12", "category": "Add a comment"},
{"title": "Rook", "price": "37.86", "rating": "Four", "description": "History has a way of repeating itself. In the Sunken City that was once Paris, all who oppose the new revolution are being put to the blade. Except for those who disappear from their prison cells, a red-tipped rook feather left in their place. The mysterious Red Rook a savior of the innocent, and a criminal in the eyes of the government.Meanwhile, across the sea in the Com History has a way of repeating itself. In the Sunken City that was once Paris, all who oppose the new revolution are being put to the blade. Except for those who disappear from their prison cells, a red-tipped rook feather left in their place. The mysterious Red Rook a savior of the innocent, and a criminal in the eyes of the government.Meanwhile, across the sea in the Commonwealth, Sophia Bellamy's arranged marriage to the wealthy René Hasard is the last chance to save her family from ruin. But when the search for the Red Rook comes straight to her doorstep, Sophia discovers that her fiancé is not all he seems. Which is only fair, because neither is she. As the Red Rook grows bolder and the stakes grow ever higher, Sophia and René find themselves locked in a tantalizing game of cat and mouse.Daring intrigue, delicious romance, and spine-tingling suspense fill the pages of this extraordinary tale from award-winning author Sharon Cameron. ...more", "number_review": "13", "category": "Add a comment"},
{"title": "A Brush of Wings (Angels Walking #3)", "price": "55.51", "rating": "One", "description": "From #1 New York Times bestselling author Karen Kingsbury comes the third novel in the unforgettable Angels Walking series about divine intervention and the trials and triumphs of life for a group of friends.Despite needing a heart transplant and against the advice of her doctor, Mary Catherine moves to Uganda to work at a brand new orphanage. Whatever time she has left, M From #1 New York Times bestselling author Karen Kingsbury comes the third novel in the unforgettable Angels Walking series about divine intervention and the trials and triumphs of life for a group of friends.Despite needing a heart transplant and against the advice of her doctor, Mary Catherine moves to Uganda to work at a brand new orphanage. Whatever time she has left, Mary Catherine wants to spend it helping children—especially since there will be no children of her own. The only problem is Major League Baseball player Marcus Dillinger, the man she never meant to fall in love with. Neither Marcus nor Mary Catherine’s other friends—Tyler Ames and Sami Dawson—know just how serious her heart condition is.Still, Marcus is sure in the depths of his soul that something isn’t right. Ultimately his correspondence with Mary Catherine leads him on a desperate life-or-death mission to rescue her and get her to a US hospital before time runs out. Meanwhile, Sami and Tyler struggle with issues of their own. In a season when Tyler plans to ask Sami to marry him, the very core of their relationship is in jeopardy.The team of angels walking is busier than ever in this epic battle between life and death. A Brush of Wings is a poignant tale of love, sacrifice, and the power of faith. ...more", "number_review": "14", "category": "Add a comment"},
{"title": "A People's History of the United States", "price": "40.79", "rating": "Two", "description": "Known for its lively, clear prose as well as its scholarly research, A People's History of the United States is the only volume to tell America's story from the point of view of - and in the words of - America's women, factory workers, African Americans, Native Americans, working poor, and immigrant laborers.", "number_review": "14", "category": "Add a comment"},
{"title": "A Series of Catastrophes and Miracles: A True Story of Love, Science, and Cancer", "price": "56.48", "rating": "Two", "description": "A wry, witty account of what it is like to face death—and be restored to life.After being diagnosed in her early 40s with metastatic melanoma—a \"rapidly fatal\" form of cancer—journalist and mother of two Mary Elizabeth Williams finds herself in a race against the clock. She takes a once-in-a-lifetime chance and joins a clinical trial for immunotherapy, a revolutionary drug A wry, witty account of what it is like to face death—and be restored to life.After being diagnosed in her early 40s with metastatic melanoma—a \"rapidly fatal\" form of cancer—journalist and mother of two Mary Elizabeth Williams finds herself in a race against the clock. She takes a once-in-a-lifetime chance and joins a clinical trial for immunotherapy, a revolutionary drug regimen that trains the body to vanquish malignant cells. Astonishingly, her cancer disappears entirely in just a few weeks. But at the same time, her best friend embarks on a cancer journey of her own—with very different results. Williams's experiences as a patient and a medical test subject reveal with stark honesty what it takes to weather disease, the extraordinary new developments that are rewriting the rules of science—and the healing power of human connection. ...more", "number_review": "14", "category": "Add a comment"},
{"title": "Angels Walking (Angels Walking #1)", "price": "34.20", "rating": "Two", "description": "When former national baseball star Tyler Ames suffers a career-ending injury, all he can think about is putting his life back together the way it was before. He has lost everyone he loves on his way to the big leagues. Then just when things seem to be turning around, Tyler hits rock bottom. Across the country, Tyler’s one true love Sami Dawson has moved on. A series of sma When former national baseball star Tyler Ames suffers a career-ending injury, all he can think about is putting his life back together the way it was before. He has lost everyone he loves on his way to the big leagues. Then just when things seem to be turning around, Tyler hits rock bottom. Across the country, Tyler’s one true love Sami Dawson has moved on. A series of small miracles leads Tyler to a maintenance job at a retirement home and a friendship with Virginia Hutcheson, an old woman with Alzheimer’s who strangely might have the answers he so desperately seeks.A team of Angels Walking take on the mission to restore hope for Tyler, Sami, and Virginia. Can such small and seemingly insignificant actions of the unseen bring healing and redemption? And can the words of a stranger rekindle lost love? Every journey begins with a step.It is time for the mission to begin… ...more", "number_review": "14", "category": "Add a comment"},
{"title": "Cell", "price": "20.29", "rating": "Four", "description": "Witness Stephen King's triumphant, blood-spattered return to the genre that made him famous. Cell, the king of horror's homage to zombie films (the book is dedicated in part to George A. Romero) is his goriest, most horrific novel in years, not to mention the most intensely paced. Casting aside his love of elaborate character and town histories and penchant for delayed gra Witness Stephen King's triumphant, blood-spattered return to the genre that made him famous. Cell, the king of horror's homage to zombie films (the book is dedicated in part to George A. Romero) is his goriest, most horrific novel in years, not to mention the most intensely paced. Casting aside his love of elaborate character and town histories and penchant for delayed gratification, King yanks readers off their feet within the first few pages; dragging them into the fray and offering no chance catch their breath until the very last page. In Cell King taps into readers fears of technological warfare and terrorism. Mobile phones deliver the apocalypse to millions of unsuspecting humans by wiping their brains of any humanity, leaving only aggressive and destructive impulses behind. Those without cell phones, like illustrator Clayton Riddell and his small band of \"normies,\" must fight for survival, and their journey to find Clayton's estranged wife and young son rockets the book toward resolution. Fans that have followed King from the beginning will recognize and appreciate Cell as a departure--King's writing has not been so pure of heart and free of hang-ups in years (wrapping up his phenomenal Dark Tower series and receiving a medal from the National Book Foundation doesn't hurt either). \"Retirement\" clearly suits King, and lucky for us, having nothing left to prove frees him up to write frenzied, juiced-up horror-thrillers like Cell. Stay tuned for more from the hardest-working retiree in the business with Lisey's Story, coming in October 2006. --Daphne Durham ...more", "number_review": "14", "category": "Add a comment"},
{"title": "Code Name Verity (Code Name Verity #1)", "price": "22.13", "rating": "Four", "description": "I have two weeks. You'll shoot me at the end no matter what I do.That's what you do to enemy agents. It's what we do to enemy agents. But I look at all the dark and twisted roads ahead and cooperation is the easy way out. Possibly the only way out for a girl caught red-handed doing dirty work like mine - and I will do anything, anything to avoid SS-Hauptsturmführer von Lin I have two weeks. You'll shoot me at the end no matter what I do.That's what you do to enemy agents. It's what we do to enemy agents. But I look at all the dark and twisted roads ahead and cooperation is the easy way out. Possibly the only way out for a girl caught red-handed doing dirty work like mine - and I will do anything, anything to avoid SS-Hauptsturmführer von Linden interrogating me again.He has said that I can have as much paper as I need. All I have to do is cough up everything I can remember about the British War Effort. And I'm going to. But the story of how I came to be here starts with my friend Maddie. She is the pilot who flew me into France - an Allied Invasion of Two.We are a sensational team. ...more", "number_review": "14", "category": "Add a comment"},
{"title": "More Than Music (Chasing the Dream #1)", "price": "37.61", "rating": "Two", "description": "Classical musician Maddie Taylor secretly dreams of a louder life, but geeky girls like her don't get to be rock stars. That is, until tattooed singer Jared Cross catches her playing guitar and invites her to join his band on The Sound, a reality TV show competition.Once on the show, Maddie discovers there's more to Jared than his flirty smile and bad boy reputation. With Classical musician Maddie Taylor secretly dreams of a louder life, but geeky girls like her don't get to be rock stars. That is, until tattooed singer Jared Cross catches her playing guitar and invites her to join his band on The Sound, a reality TV show competition.Once on the show, Maddie discovers there's more to Jared than his flirty smile and bad boy reputation. With each performance their attraction becomes impossible to ignore, but when the show pressures them to stay single, they're forced to keep their relationship secret.As the competition heats up, Jared will do whatever it takes for his band to win, and Maddie must decide if following her dream is worth losing her heart. ...more", "number_review": "14", "category": "Add a comment"}